coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
/*
 * iodef.h
 *
 *  Created on: 22 Eyl 2017
 *      Author: erkan.guzeler
 */



/**************************************************************************//**
 * @file     lpc11xx.h
 * @brief    Base header file for using NXP LPC11xx/LPC11Cxx microcontrollers.
 * @version  V1.0
 * @author   Tymm Twillman
 * @date     1. January 2012
 ******************************************************************************
 * @section Overview
 * This file contains peripheral register & interrupt definitions for NXP
 * LPC11xx microcontrollers.
 *
 * Microcontrollers handled by this file:
 * - LPC1102
 * - LPC1111  (LPC1111/x01)
 * - LPC1111L (LPC1111/x02)
 * - LPC1112  (LPC1112/x01)
 * - LPC1112L (LPC1112/x02)
 * - LPC1113  (LPC1113/x01)
 * - LPC1113L (LPC1113/x02)
 * - LPC1114  (LPC1114/x01)
 * - LPC1114L (LPC1114/x02)
 * - LPC11C14
 * - LPC11C24
 *
 * The structure of this file:
 * - Basic core-level LPC11xx definitions (IRC clock, Cortex-M0 configuration)
 * - Interrupt numbering
 * - Importing core_cm0.h from ARM CMSIS package for Cortex-M0 interface
 * - Peripheral register types
 * - Peripheral register bit definitions
 * - Peripheral memory locations
 * - Peripheral instances
 *
 * @note
 * Not all peripherals are brought out on all chips; those with lower pin
 * counts for example may not have SSP1, and not all GPIO lines will be
 * available on chips with fewer pins.
 *
 * @note
 * For proper exporting of the full & correct peripheral interfaces:
 * - Define the symbol LPC11XX for base series chips (LPC1111/2/3/4).
 * - Define the symbol LPC11XXL for enhanced chips (power profiles, etc).
 * - Define the symbole LPC11CXX for CAN enabled chips.
 ******************************************************************************
 * @section License
 * Licensed under a Simplified BSD License:
 *
 * Copyright (c) 2012, Timothy Twillman
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions are met:
 *
 *    1. Redistributions of source code must retain the above copyright notice,
 *        this list of conditions and the following disclaimer.
 *
 *    2. Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED ''AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 * AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL
 * TIMOTHY TWILLMAN OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
 * NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * The views and conclusions contained in the software and documentation are
 * those of the authors and should not be interpreted as representing official
 * policies, either expressed or implied, of Timothy Twillman.
 *****************************************************************************/

#ifndef INC_IODEF_H_
#define INC_IODEF_H_

#ifdef __cplusplus
extern "C" {
#endif

/**
  * @addtogroup LPC11xx_Core LPC11xx Core Peripheral & Interrupt Definitions
  * @{
  */

/* Defines --------------------------------------------------------------------------------------*/

#define IRC_Val                 (12000000UL)    /*!< Speed of internal RC Oscillator (12 Mhz)    */


/** @defgroup LPC11xx_Cortex_M0_Configuration LPC11xx Cortex-M0 MCU Configuration
  * @{
  */

#define __NVIC_PRIO_BITS        (3)             /*!< Number of Priority Bits used by the NVIC    */
#define __Vendor_SysTickConfig  (0)             /*!< No vendor-specific SysTick configuration    */
#define __CM0_REV               (0x0000)        /*!< Cortex-M0 Core is Revision 0                */

/** @} */


/* IRQ Numbers ----------------------------------------------------------------------------------*/

/** @defgroup LPC11xx_IRQn LPC11xx IRQ Numbers
  * @{
  */

/** @} */


/* Include for Core Cortex-M0 types, defines, etc. ----------------------------------------------*/

#include "core_cm0.h"


/**
  * @defgroup LPC11xx_Peripherals LPC11xx Peripherals
  * @{
  */

/* Peripheral Registers -------------------------------------------------------------------------*/

/** @defgroup I2C I2C: Inter-Integrated Circuit (Two Wire Interface)
  * @{
  */

/*! @brief I2C Register Map */
typedef struct {
    __IO    uint32_t    CONSET;        /*!< Offset: 0x000  Control Set Register                  */
    __I     uint32_t    STAT;          /*!< Offset: 0x004  Status Register                       */
    __IO    uint32_t    DAT;           /*!< Offset: 0x008  Data Register                         */
    __IO    uint32_t    ADR0;          /*!< Offset: 0x00c  Address Register 0                    */
    __IO    uint32_t    SCLH;          /*!< Offset: 0x010  SCL Duty Cycle High                   */
    __IO    uint32_t    SCLL;          /*!< Offset: 0x014  SCL Duty Cycle Low                    */
    __O     uint32_t    CONCLR;        /*!< Offset: 0x018  Control Clear Register                */
    __IO    uint32_t    MMCTRL;        /*!< Offset: 0x01c  Monitor Mode Control                  */
    __IO    uint32_t    ADR1;          /*!< Offset: 0x020  Address Register 1                    */
    __IO    uint32_t    ADR2;          /*!< Offset: 0x024  Address Register 2                    */
    __IO    uint32_t    ADR3;          /*!< Offset: 0x028  Address Register 3                    */
    __I     uint32_t    DATA_BUFFER;   /*!< Offset: 0x02c  Data Buffer Register                  */
    __IO    uint32_t    MASK0;         /*!< Offset: 0x030  Slave Address Mask Register 0         */
    __IO    uint32_t    MASK1;         /*!< Offset: 0x034  Slave Address Mask Register 1         */
    __IO    uint32_t    MASK2;         /*!< Offset: 0x038  Slave Address Mask Register 2         */
    __IO    uint32_t    MASK3;         /*!< Offset: 0x03c  Slave Address Mask Register 3         */
} I2C_Type;

/** @} */

/** @defgroup WDT WDT: Watchdog Timer
  * @{
  */

/*! @brief Watchdog Timer Register Map (LPC11XXL)*/
typedef struct {
    __IO    uint32_t    MOD;           /*!< Offset: 0x000  Watchdog Mode Register                */
    __IO    uint32_t    TC;            /*!< Offset: 0x004  Timer Constant Register               */
    __O     uint32_t    FEED;          /*!< Offset: 0x008  Feed Sequence Register                */
    __I     uint32_t    TV;            /*!< Offset: 0x00c  Timer Value Register                  */

