coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
#if defined(LPC11XXL)  /* L-Series parts have windowed WDT with the following added registers    */
            uint32_t      Reserved4[1];                                          /*!< (Reserved) */
    __IO    uint32_t    WARNINT;       /*!< Offset: 0x014  Watchdog Warn Interrupt Compare Value */
    __IO    uint32_t    WINDOW;        /*!< Offset: 0x018  Timer Window Register                 */
#endif

} WDT_Type;

/** @} */

/** @defgroup UART UART: Universal Asynchronous Receiver Transmitter
  * @{
  */

/*! @brief UART Register Map */
typedef struct {
    union {
        __I  uint32_t   RBR;           /*!< Offset: 0x000  Receive Buffer Register   (DLAB=0)    */
        __O  uint32_t   THR;           /*!< Offset: 0x000  Transmit Holding Register (DLAB=0)    */
        __IO uint32_t   DLL;           /*!< Offset: 0x000  Divisor Latch LSB         (DLAB=1)    */
    };

    union {
        __IO uint32_t   DLM;           /*!< Offset: 0x004  Divisor Latch MSB         (DLAB=1)    */
        __IO uint32_t   IER;           /*!< Offset: 0x004  Interrupt Enable Register (DLAB=0)    */
    };

    union {
        __I uint32_t    IIR;           /*!< Offset: 0x008  Interrupt ID Register                 */
        __O uint32_t    FCR;           /*!< Offset: 0x008  FIFO Control Register                 */
    };

    __IO    uint32_t    LCR;           /*!< Offset: 0x00c  Line Control Register                 */
    __IO    uint32_t    MCR;           /*!< Offset: 0x010  Modem Control Register                */
    __I     uint32_t    LSR;           /*!< Offset: 0x014  Line Status Register                  */
    __I     uint32_t    MSR;           /*!< Offset: 0x018  Modem Status Register                 */
    __IO    uint32_t    SCR;           /*!< Offset: 0x01C  Scratch Pad Register                  */
    __IO    uint32_t    ACR;           /*!< Offset: 0x020  Auto-Baud Control Register            */
            uint32_t      Reserved9[1];                                          /*!< (Reserved) */
    __IO    uint32_t    FDR;           /*!< Offset: 0x028  Fractional Divider Register           */
            uint32_t      Reserved11[1];                                         /*!< (Reserved) */
    __IO    uint32_t    TER;           /*!< Offset: 0x030  Transmit Enable Register              */
            uint32_t      Reserved13_18[6];                                      /*!< (Reserved) */
    __IO    uint32_t    RS485CTRL;     /*!< Offset: 0x04c  RS485 Mode Control                    */
    __IO    uint32_t    ADRMATCH;      /*!< Offset: 0x050  RS485 Address Match                   */
    __IO    uint32_t    RS485DLY;      /*!< Offset: 0x054  RS485 Direction Control Delay         */
    __I     uint32_t    FIFOLVL;       /*!< Offset: 0x058  FIFO Level Register (?)               */
} UART_Type;

/** @} */

/** @defgroup ADC ADC: Analog to Digital Converter
  * @{
  */

/*! @brief ADC Register Map */
typedef struct {
    __IO    uint32_t    CR;            /*!< Offset: 0x000  A/D Control Register                  */
    __IO    uint32_t    GDR;           /*!< Offset: 0x004  A/D Global Data Register              */
    uint32_t              Reserved2[1];                                          /*!< (Reserved) */
    __IO    uint32_t    INTEN;         /*!< Offset: 0x00c  Interrupt Enable Register             */
    __IO    uint32_t    DR0;           /*!< Offset: 0x010  Channel 0 Data Register               */
    __IO    uint32_t    DR1;           /*!< Offset: 0x014  Channel 1 Data Register               */
    __IO    uint32_t    DR2;           /*!< Offset: 0x018  Channel 2 Data Register               */
    __IO    uint32_t    DR3;           /*!< Offset: 0x01c  Channel 3 Data Register               */
    __IO    uint32_t    DR4;           /*!< Offset: 0x020  Channel 4 Data Register               */
    __IO    uint32_t    DR5;           /*!< Offset: 0x024  Channel 5 Data Register               */
    __IO    uint32_t    DR6;           /*!< Offset: 0x028  Channel 6 Data Register               */
    __IO    uint32_t    DR7;           /*!< Offset: 0x02c  Channel 7 Data Register               */
    __I     uint32_t    STAT;          /*!< Offset: 0x030  Status Register                       */
} ADC_Type;

/** @} */

/** @defgroup PMU PMU: Power Management Unit
  * @{
  */

/*! @brief PMU Register Map */
typedef struct {
    __IO    uint32_t    PCON;          /*!< Offset: 0x000  Power Control Register                */
    __IO    uint32_t    GPREG0;        /*!< Offset: 0x004  General Purpose Register 0            */
    __IO    uint32_t    GPREG1;        /*!< Offset: 0x008  General Purpose Register 1            */
    __IO    uint32_t    GPREG2;        /*!< Offset: 0x00c  General Purpose Register 2            */
    __IO    uint32_t    GPREG3;        /*!< Offset: 0x010  General Purpose Register 3            */
    __IO    uint32_t    GPREG4;        /*!< Offset: 0x014  GP Register 4 / Wakeup Hysteresis     */
} PMU_Type;

/** @} */

/** @defgroup FLASH FLASH: Flash Memory Configuration Block
  * @{
  */

/*! @brief FLASH Register Map */
typedef struct {
            uint32_t      Reserved0_3[4];                                        /*!< (Reserved) */
    __IO    uint32_t    FLASHCFG;      /*!< Offset: 0x010  Flash Latency Configuration           */
            uint32_t      Reserved5_7[3];                                        /*!< (Reserved) */
    __IO    uint32_t    FMSSTART;      /*!< Offset: 0x020  Flash Signature Start Address         */
    __IO    uint32_t    FMSEND;        /*!< Offset: 0x024  Flash Signature Stop Address          */
            uint32_t      Reserved10[1];                                         /*!< (Reserved) */
    __I     uint32_t    FMSW0;         /*!< Offset: 0x02c  Flash Signature Word 0                */
    __I     uint32_t    FMSW1;         /*!< Offset: 0x030  Flash Signature Word 1                */
    __I     uint32_t    FMSW2;         /*!< Offset: 0x034  Flash Signature Word 2                */
    __I     uint32_t    FMSW3;         /*!< Offset: 0x038  Flash Signature Word 3                */
            uint32_t      Reserved15_1015[1001];                                 /*!< (Reserved) */
    __I     uint32_t    FMSTAT;        /*!< Offset: 0xfe0  Flash Signature Generation Status Reg */
            uint32_t      Reserved1017[1];                                       /*!< (Reserved) */
    __O     uint32_t    FMSTATCLR;     /*!< Offset: 0xfe8  Flash Signature Gen Status Clear Reg  */
} FLASH_Type;

/** @} */

/** @defgroup SSP SSP: Synchronous Serial Peripheral
  * @{
  */

/*! @brief SSP Register Map */
typedef struct {
    __IO    uint32_t    CR0;           /*!< Offset: 0x000  Control Register 0                    */
    __IO    uint32_t    CR1;           /*!< Offset: 0x004  Control Register 1                    */
    __IO    uint32_t    DR;            /*!< Offset: 0x008  Data Register                         */
    __I     uint32_t    SR;            /*!< Offset: 0x00c  Status Register                       */
    __IO    uint32_t    CPSR;          /*!< Offset: 0x010  Clock Prescale Register               */
    __IO    uint32_t    IMSC;          /*!< Offset: 0x014  Interrupt Mask Set/Clear              */
    __IO    uint32_t    RIS;           /*!< Offset: 0x018  Raw Interrupt Status                  */
    __IO    uint32_t    MIS;           /*!< Offset: 0x01c  Masked Interrupt Status               */
    __IO    uint32_t    ICR;           /*!< Offset: 0x020  Interrupt Clear Register              */
} SSP_Type;

/** @} */

/** @defgroup    IOCON IOCON: IO Configuration Block
  * @{
  */

