coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
/*! @brief IOCON Register Map */
typedef struct {
    __IO    uint32_t    PIO2_6;        /*!< Offset: 0x000  PIO2_6 Configuration                  */
            uint32_t      Reserved1[1];                                          /*!< (Reserved) */
    __IO    uint32_t    PIO2_0;        /*!< Offset: 0x008  PIO2_0 Configuration                  */
    __IO    uint32_t    RESET_PIO0_0;  /*!< Offset: 0x00c  PIO0_0 Configuration                  */
    __IO    uint32_t    PIO0_1;        /*!< Offset: 0x010  PIO0_1 Configuration                  */
    __IO    uint32_t    PIO1_8;        /*!< Offset: 0x014  PIO1_8 Configuration                  */
            uint32_t      Reserved6[1];                                          /*!< (Reserved) */
    __IO    uint32_t    PIO0_2;        /*!< Offset: 0x018  PIO0_2 Configuration                  */
    __IO    uint32_t    PIO2_7;        /*!< Offset: 0x01c  PIO2_7 Configuration                  */
    __IO    uint32_t    PIO2_8;        /*!< Offset: 0x020  PIO2_8 Configuration                  */
    __IO    uint32_t    PIO2_1;        /*!< Offset: 0x024  PIO2_1 Configuration                  */
    __IO    uint32_t    PIO0_3;        /*!< Offset: 0x028  PIO0_3 Configuration                  */
    __IO    uint32_t    PIO0_4;        /*!< Offset: 0x02c  PIO0_4 Configuration                  */
    __IO    uint32_t    PIO0_5;        /*!< Offset: 0x030  PIO0_5 Configuration                  */
    __IO    uint32_t    PIO1_9;        /*!< Offset: 0x034  PIO1_9 Configuration                  */
    __IO    uint32_t    PIO3_4;        /*!< Offset: 0x038  PIO3_4 Configuration                  */
    __IO    uint32_t    PIO2_4;        /*!< Offset: 0x03c  PIO2_4 Configuration                  */
    __IO    uint32_t    PIO2_5;        /*!< Offset: 0x040  PIO2_5 Configuration                  */
    __IO    uint32_t    PIO3_5;        /*!< Offset: 0x044  PIO3_5 Configuration                  */
    __IO    uint32_t    PIO0_6;        /*!< Offset: 0x048  PIO0_6 Configuration                  */
    __IO    uint32_t    PIO0_7;        /*!< Offset: 0x04c  PIO0_7 Configuration                  */
    __IO    uint32_t    PIO2_9;        /*!< Offset: 0x050  PIO2_9 Configuration                  */
    __IO    uint32_t    PIO2_10;       /*!< Offset: 0x054  PIO2_10Configuration                  */
    __IO    uint32_t    PIO2_2;        /*!< Offset: 0x058  PIO2_2 Configuration                  */
    __IO    uint32_t    PIO0_8;        /*!< Offset: 0x05c  PIO0_8 Configuration                  */
    __IO    uint32_t    PIO0_9;        /*!< Offset: 0x060  PIO0_9 Configuration                  */
    __IO    uint32_t    SWCLK_PIO0_10; /*!< Offset: 0x064  PIO0_10Configuration                  */
    __IO    uint32_t    PIO1_10;       /*!< Offset: 0x068  PIO1_10Configuration                  */
    __IO    uint32_t    PIO2_11;       /*!< Offset: 0x06c  PIO2_11Configuration                  */
    __IO    uint32_t    R_PIO0_11;     /*!< Offset: 0x070  PIO0_11Configuration                  */
    __IO    uint32_t    R_PIO1_0;      /*!< Offset: 0x074  PIO1_0 Configuration                  */
    __IO    uint32_t    R_PIO1_1;      /*!< Offset: 0x078  PIO1_1 Configuration                  */
    __IO    uint32_t    R_PIO1_2;      /*!< Offset: 0x07c  PIO1_2 Configuration                  */
    __IO    uint32_t    PIO3_0;        /*!< Offset: 0x080  PIO3_0 Configuration                  */
    __IO    uint32_t    PIO3_1;        /*!< Offset: 0x084  PIO3_1 Configuration                  */
    __IO    uint32_t    PIO2_3;        /*!< Offset: 0x088  PIO2_3 Configuration                  */
    __IO    uint32_t    SWDIO_PIO1_3;  /*!< Offset: 0x08c  PIO1_3 Configuration                  */
    __IO    uint32_t    PIO1_4;        /*!< Offset: 0x090  PIO1_4 Configuration                  */
    __IO    uint32_t    PIO1_11;       /*!< Offset: 0x094  PIO1_11Configuration                  */
    __IO    uint32_t    PIO3_2;        /*!< Offset: 0x098  PIO3_2 Configuration                  */
    __IO    uint32_t    PIO1_5;        /*!< Offset: 0x09c  PIO1_5 Configuration                  */
    __IO    uint32_t    PIO1_6;        /*!< Offset: 0x0a0  PIO1_6 Configuration                  */
    __IO    uint32_t    PIO1_7;        /*!< Offset: 0x0a4  PIO1_7 Configuration                  */
    __IO    uint32_t    PIO3_3;        /*!< Offset: 0x0a8  PIO3_3 Configuration                  */
    __IO    uint32_t    SCK0_LOC;      /*!< Offset: 0x0ac  SSP 0 SCK Location                    */
    __IO    uint32_t    DSR0_LOC;      /*!< Offset: 0x0b0  UART 0 DSR Location                   */
    __IO    uint32_t    DCD0_LOC;      /*!< Offset: 0x0b4  UART 0 DCD Location                   */
    __IO    uint32_t    RI0_LOC;       /*!< Offset: 0x0b8  UART 0 RI Location                    */
} IOCON_Type;

/** @} */

/** @defgroup SYSCON SYSCON: System Configuration Block
  * @{
  */

/*! @brief SYSCON Register Map */
typedef struct {
    __IO    uint32_t    SYSMEMREMAP;   /*!< Offset: 0x000  System Memory Remap Control           */
    __IO    uint32_t    PRESETCTRL;    /*!< Offset: 0x004  Peripheral Reset Control              */
    __IO    uint32_t    SYSPLLCTRL;    /*!< Offset: 0x008  System PLL Control                    */
    __I     uint32_t    SYSPLLSTAT;    /*!< Offset: 0x00c  System PLL Status                     */
            uint32_t      Reserved4_7[4];                                        /*!< (Reserved) */
    __IO    uint32_t    SYSOSCCTRL;    /*!< Offset: 0x020  System Oscillator Control             */
    __IO    uint32_t    WDTOSCCTRL;    /*!< Offset: 0x024  Watchdog Timer Oscillator Control     */
    __IO    uint32_t    IRCCTRL;       /*!< Offset: 0x028  Internal RC Clock Trim                */
            uint32_t      Reserved11[1];                                         /*!< (Reserved) */
    __IO    uint32_t    SYSRESSTAT;    /*!< Offset: 0x030  System Reset Source Identification    */
            uint32_t      Reserved13_15[3];                                      /*!< (Reserved) */
    __IO    uint32_t    SYSPLLCLKSEL;  /*!< Offset: 0x040  System PLL Clock Source               */
    __IO    uint32_t    SYSPLLCLKUEN;  /*!< Offset: 0x044  System PLL Clock Enable               */
            uint32_t      Reserved18_27[10];                                     /*!< (Reserved) */
   __IO     uint32_t    MAINCLKSEL;    /*!< Offset: 0x070  Main Clock Source                     */
   __IO     uint32_t    MAINCLKUEN;    /*!< Offset: 0x074  Main Clock Enable                     */
   __IO     uint32_t    SYSAHBCLKDIV;  /*!< Offset: 0x078  AHB Clock Divider                     */
            uint32_t      Reserved31[1];                                         /*!< (Reserved) */
   __IO     uint32_t    SYSAHBCLKCTRL; /*!< Offset: 0x080  AHB Clock Control                     */
            uint32_t      Reserved33_36[4];                                      /*!< (Reserved) */
   __IO     uint32_t    SSP0CLKDIV;    /*!< Offset: 0x094  SSP0 Clock Divider                    */
   __IO     uint32_t    UART0CLKDIV;   /*!< Offset: 0x098  UART0 Clock Divider                   */
   __IO     uint32_t    SSP1CLKDIV;    /*!< Offset: 0x09c  SSP1 Clock Divider                    */
            uint32_t      Reserved40_51[12];                                     /*!< (Reserved) */
   __IO     uint32_t    WDTCLKSEL;     /*!< Offset: 0x0d0  Watchdog Clock Source                 */
   __IO     uint32_t    WDTCLKUEN;     /*!< Offset: 0x0d4  Watchdog Clock Enable                 */
   __IO     uint32_t    WDTCLKDIV;     /*!< Offset: 0x0d8  Watchdog Clock Divider                */
            uint32_t      Reserved55[1];                                         /*!< (Reserved) */
   __IO     uint32_t    CLKOUTCLKSEL;  /*!< Offset: 0x0e0  CLKOUT Clock Select                   */
   __IO     uint32_t    CLKOUTUEN;     /*!< Offset: 0x0e4  CLKOUT Enable                         */
   __IO     uint32_t    CLKOUTDIV;     /*!< Offset: 0x0e8  CLKOUT Divider                        */
            uint32_t      Reserved59_63[5];                                      /*!< (Reserved) */
   __I      uint32_t    PIOPORCAP0;    /*!< Offset: 0x100  Power On Reset Captured Pin Status 0  */
   __I      uint32_t    PIOPORCAP1;    /*!< Offset: 0x104  Power On Reset Captured Pin Status 1  */
            uint32_t      Reserved66_83[18];                                     /*!< (Reserved) */
   __IO     uint32_t    BODCTRL;       /*!< Offset: 0x150  Brownout Detetector Control           */
   __IO     uint32_t    SYSTCKCAL;     /*!< Offset: 0x154  SysTick Calibration Value             */
            uint32_t      Reserved86_127[42];                                    /*!< (Reserved) */
   __IO     uint32_t    STARTAPRP0;    /*!< Offset: 0x200  Start Logic Edges                     */
   __IO     uint32_t    STARTERP0;     /*!< Offset: 0x204  Start Logic Enables                   */
   __IO     uint32_t    STARTRSRP0CLR; /*!< Offset: 0x208  Start Logic Clear                     */
   __IO     uint32_t    STARTSRP0;     /*!< Offset: 0x20c  Start Logic Status                    */
            uint32_t      Reserved132_139[8];                                    /*!< (Reserved) */
   __IO     uint32_t    PDSLEEPCFG;    /*!< Offset: 0x230  Deep Sleep Mode Power Down Config     */
   __IO     uint32_t    PDAWAKECFG;    /*!< Offset: 0x234  Wakeup Mode Power Down Configuration  */
   __IO     uint32_t    PDRUNCFG;      /*!< Offset: 0x238  Running Mode Power Down Configuration */
            uint32_t      Reserved143_582[110];                                  /*!< (Reserved) */
   __I      uint32_t    DEVICE_ID;     /*!< Offset: 0x3f4  LPC Device ID                         */
} SYSCON_Type;

/** @} */

/** @defgroup CT16B CT16B: 16-Bit Counter / Timer
  * @{
  */

/*! @brief CT16B Register Map */
typedef struct {
    __IO    uint32_t    IR;            /*!< Offset: 0x000  Interrupt Register                    */
    __IO    uint32_t    TCR;           /*!< Offset: 0x004  Timer Control Register                */
    __IO    uint32_t    TC;            /*!< Offset: 0x008  Timer Counter Register                */
    __IO    uint32_t    PR;            /*!< Offset: 0x00c  Prescale Register                     */
    __IO    uint32_t    PC;            /*!< Offset: 0x010  Prescale Counter Register             */
    __IO    uint32_t    MCR;           /*!< Offset: 0x014  Match Control Register                */
    __IO    uint32_t    MR0;           /*!< Offset: 0x018  MAT0 Match Register                   */
    __IO    uint32_t    MR1;           /*!< Offset: 0x01c  MAT1 Match Register                   */
    __IO    uint32_t    MR2;           /*!< Offset: 0x020  MAT2 Match Register                   */
    __IO    uint32_t    MR3;           /*!< Offset: 0x024  MAT3 Match Register                   */
    __IO    uint32_t    CCR;           /*!< Offset: 0x028  Counter Control Register              */
    __I     uint32_t    CR0;           /*!< Offset: 0x02c  Capture Channel 0 Register            */
            uint32_t      Reserved12_14[3];                                      /*!< (Reserved) */
    __IO    uint32_t    EMR;           /*!< Offset: 0x03c  External Match Register               */
            uint32_t      Reserved16_27[12];                                     /*!< (Reserved) */
    __IO    uint32_t    CTCR;          /*!< Offset: 0x070  Count Control Register                */
    __IO    uint32_t    PWMC;          /*!< Offset: 0x074  PWM Control Register                  */
} CT16B_Type;

/** @} */

/** @defgroup CT32B CT32B: 32-Bit Counter / Timer
  * @{
  */

/*! @brief CT32B Register Map */
typedef struct {
    __IO    uint32_t    IR;            /*!< Offset: 0x000  Interrupt Register                    */
    __IO    uint32_t    TCR;           /*!< Offset: 0x004  Timer Control Register                */
    __IO    uint32_t    TC;            /*!< Offset: 0x008  Timer Counter Register                */
    __IO    uint32_t    PR;            /*!< Offset: 0x00c  Prescale Register                     */
    __IO    uint32_t    PC;            /*!< Offset: 0x010  Prescale Counter Register             */
    __IO    uint32_t    MCR;           /*!< Offset: 0x014  Match Control Register                */
    __IO    uint32_t    MR0;           /*!< Offset: 0x018  MAT0 Match Register                   */
    __IO    uint32_t    MR1;           /*!< Offset: 0x01c  MAT1 Match Register                   */
    __IO    uint32_t    MR2;           /*!< Offset: 0x020  MAT2 Match Register                   */
    __IO    uint32_t    MR3;           /*!< Offset: 0x024  MAT3 Match Register                   */
    __IO    uint32_t    CCR;           /*!< Offset: 0x028  Counter Control Register              */
    __I     uint32_t    CR0;           /*!< Offset: 0x02c  Capture Channel 0 Register            */
            uint32_t      Reserved12_14[3];                                      /*!< (Reserved) */
    __IO    uint32_t    EMR;           /*!< Offset: 0x03c  External Match Register               */
            uint32_t      Reserved16_27[12];                                     /*!< (Reserved) */
    __IO    uint32_t    CTCR;          /*!< Offset: 0x070  Count Control Register                */
    __IO    uint32_t    PWMC;          /*!< Offset: 0x074  PWM Control Register                  */
} CT32B_Type;

/** @} */

/** @defgroup GPIO GPIO: General Purpose IO
  * @{
  */

/*! @brief GPIO Register Map */
typedef struct {
    __IO    uint32_t    SELDATA[4095]; /*!< Offset: 0x0000  Address-Selected IO Data             */
    __IO    uint32_t    DATA;          /*!< Offset: 0x7ffc  All IO Pins Data                     */
    __IO    uint32_t      Reserved[4096];                                        /*!< (Reserved) */
    __IO    uint32_t    DIR;           /*!< Offset: 0x8000  Data Direction Register              */
    __IO    uint32_t    IS;            /*!< Offset: 0x8004  Interrupt Sense Register             */
    __IO    uint32_t    IBE;           /*!< Offset: 0x8008  Interrupt Both Edges Register        */
    __IO    uint32_t    IEV;           /*!< Offset: 0x800c  Interrupt Event Register             */
    __IO    uint32_t    IE;            /*!< Offset: 0x8010  Interrupt Mask Register              */
    __I     uint32_t    RIS;           /*!< Offset: 0x8014  Raw Interrupt Stat Register          */
    __I     uint32_t    MIS;           /*!< Offset: 0x8018  Masked Interrupt Status Register     */
    __O     uint32_t    IC;            /*!< Offset: 0x801c  Interrupt Clear Register             */
} GPIO_Type;

/** @} */


#if defined(LPC11CXX)

