coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
/** @defgroup CAN CAN: Controller Area Network
  * @{
  */

/*! @brief CAN Register Map */
typedef struct {
    __IO    uint32_t    CNTL;          /*!< Offset: 0x000  Control Register                      */
    __IO    uint32_t    STAT;          /*!< Offset: 0x004  Status Register                       */
    __O     uint32_t    EC;            /*!< Offset: 0x008  Error Counter Register                */
    __IO    uint32_t    BT;            /*!< Offset: 0x00c  Bit Timing Register                   */
    __O     uint32_t    INT;           /*!< Offset: 0x010  Interrupt Register                    */
    __IO    uint32_t    TEST;          /*!< Offset: 0x014  Test Register                         */
    __IO    uint32_t    BRPE;          /*!< Offset: 0x018  Baud Rate Prescaler Extension         */
            uint32_t      Reserved7[1];                                          /*!< (Reserved) */
    __IO    uint32_t    IF1_CMDREQ;    /*!< Offset: 0x020  Interface 1 Command Request Register  */
    __IO    uint32_t    IF1_CMDMSK;    /*!< Offset: 0x024  Interface 1 Command Mask Register     */
    __IO    uint32_t    IF1_IDMSK1;    /*!< Offset: 0x028  Interface 1 Identifier Mask 1 Register*/
    __IO    uint32_t    IF1_IDMSK2;    /*!< Offset: 0x02c  Interface 1 Identifier Mask 2 Register*/
    __IO    uint32_t    IF1_ARB1;      /*!< Offset: 0x030  Interface 1 Arbitration 1 Register    */
    __IO    uint32_t    IF1_ARB2;      /*!< Offset: 0x034  Interface 1 Arbitration 2 Register    */
    __IO    uint32_t    IF1_MCTRL;     /*!< Offset: 0x038  Interface 1 Message Control Register  */
    __IO    uint32_t    IF1_DA1;       /*!< Offset: 0x03c  Interface 1 Data A1 Register          */
    __IO    uint32_t    IF1_DA2;       /*!< Offset: 0x040  Interface 1 Data A2 Register          */
    __IO    uint32_t    IF1_DB1;       /*!< Offset: 0x044  Interface 1 Data B1 Register          */
    __IO    uint32_t    IF1_DB2;       /*!< Offset: 0x048  Interface 1 Data B2 Register          */
    __IO    uint32_t    IF1_DB2;       /*!< Offset: 0x04c  Interface 1 Data B2 Register          */
            uint32_t      Reserved20_23[4];                                      /*!< (Reserved) */
    __IO    uint32_t    IF2_CMDREQ;    /*!< Offset: 0x060  Interface 2 Command Request Register  */
    __IO    uint32_t    IF2_CMDMSK;    /*!< Offset: 0x064  Interface 2 Command Mask Register     */
    __IO    uint32_t    IF2_IDMSK1;    /*!< Offset: 0x068  Interface 2 Identifier Mask 1 Register*/
    __IO    uint32_t    IF2_IDMSK2;    /*!< Offset: 0x06c  Interface 2 Identifier Mask 2 Register*/
    __IO    uint32_t    IF2_ARB1;      /*!< Offset: 0x070  Interface 2 Arbitration 1 Register    */
    __IO    uint32_t    IF2_ARB2;      /*!< Offset: 0x074  Interface 2 Arbitration 2 Register    */
    __IO    uint32_t    IF2_MCTRL;     /*!< Offset: 0x078  Interface 2 Message Control Register  */
    __IO    uint32_t    IF2_DA1;       /*!< Offset: 0x07c  Interface 2 Data A1 Register          */
    __IO    uint32_t    IF2_DA2;       /*!< Offset: 0x080  Interface 2 Data A2 Register          */
    __IO    uint32_t    IF2_DB1;       /*!< Offset: 0x084  Interface 2 Data B1 Register          */
    __IO    uint32_t    IF2_DB2;       /*!< Offset: 0x088  Interface 2 Data B2 Register          */
    __IO    uint32_t    IF2_DB2;       /*!< Offset: 0x08c  Interface 2 Data B2 Register          */
            uint32_t      Reserved36_63[28];                                     /*!< (Reserved) */
    __O     uint32_t    TXREQ1;        /*!< Offset: 0x100  Transmission Request Register 1       */
    __O     uint32_t    TXREQ2;        /*!< Offset: 0x104  Transmission Request Register 2       */
            uint32_t      Reserved66_71[6];                                      /*!< (Reserved) */
    __O     uint32_t    ND1;           /*!< Offset: 0x120  New Data Register 1                   */
    __O     uint32_t    ND2;           /*!< Offset: 0x104  New Data Register 2                   */
            uint32_t      Reserved74_79[6];                                      /*!< (Reserved) */
    __O     uint32_t    IR1;           /*!< Offset: 0x140  Interrupt Pending Register 1          */
    __O     uint32_t    IR2;           /*!< Offset: 0x144  Interrupt Pending Register 2          */
            uint32_t      Reserved82_87[6];                                      /*!< (Reserved) */
    __O     uint32_t    MSGV1;         /*!< Offset: 0x160  Message Valid Register 1              */
    __O     uint32_t    MSGV2;         /*!< Offset: 0x164  Message Valid Register 2              */
            uint32_t      Reserved90_95[6];                                      /*!< (Reserved) */
    __IO    uint32_t    CLKDIV;        /*!< Offset: 0x180  Clock Divider                         */
} CAN_Type;

/** @} */

#endif /* #if defined(LPC11CXX) */


/* Peripheral Register Bit Definitions  -------------------------------------*/

/** @defgroup I2C_Register_Bit_Definitions I2C Register Bit Definitions
  * @ingroup  I2C
  * @{
  */

/** @defgroup I2C_CONSET_Bit_Definitions CONSET: Control Set Register
  * @{
  */

#define I2C_CONSET_Mask                (0x7c)              /*!< Usable bits in CONSET register   */

#define I2C_AA                         (1 << 2)            /*!< Assert Acknowledge Set Bit       */
#define I2C_SI                         (1 << 3)            /*!< I2C Interrupt Enable Bit         */
#define I2C_STO                        (1 << 4)            /*!< STOP Flag Set Bit                */
#define I2C_STA                        (1 << 5)            /*!< START Flag Set Bit               */
#define I2C_I2EN                       (1 << 6)            /*!< I2C Interface Enable Bit         */

/** @} */

/** @defgroup I2C_CONCLR_Bit_Definitions CONCLR: Control Clear Register
  * @{
  */

#define I2C_CONCLR_Mask                (0x6c)              /*!< Usable bits in CONCLR register   */

#define I2C_AAC                        (1 << 2)            /*!< Assert Acknowledge Clear Bit     */
#define I2C_SIC                        (1 << 3)            /*!< I2C Interrupt Disable Flag       */
#define I2C_STAC                       (1 << 5)            /*!< START Flag Clear Bit             */
#define I2C_I2ENC                      (1 << 6)            /*!< I2C Interface Disable Bit        */

/** @} */

/** @defgroup I2C_STAT_Bit_Definitions STAT: Status Register
  * @{
  */

