coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
#define I2C_STAT_Mask                  (0xf8)              /*!< Usable bits in STAT register     */

/** @} */

/** @defgroup I2C_DAT_Bit_Definitions DAT: Data Register
  * @{
  */

#define I2C_DAT_Mask                   (0xff)              /*!< Usable bits in DAT register      */

/** @} */

/** @defgroup I2C_ADR0-3_Bit_Definitions ADRn: Slave Address Register
  * @{
  */

#define I2C_ADR_Mask                   (0xff)              /*!< Usable bits in ADRn Registers    */

#define I2C_ADDR_Mask                  (0x7f << 1)         /*!< Address Mask (7 bits)            */
#define I2C_ADDR_Shift                 (1)                 /*!< Bit shift of ADDR Mask           */

#define I2C_GC                         (1 << 0)            /*!< Gen. Call Enable (Answer 0x00)   */

/** @} */

/** @defgroup I2C_MASK0-3_Bit_Definitions MASKn: Slave Address Mask Register
  * @{
  */

#define I2C_MASK_Mask                  (0xfe)              /*!< Usable bits in MASKn Registers   */

#define I2C_ADDRMASK_Mask              (0x7f << 1)         /*!< Address n Mask (7 bits)          */
#define I2C_ADDRMASK_Shift             (1)                 /*!< Bit shift of MASK Mask           */

/** @} */

/** @defgroup I2C_SCLH_Bit_Definitions SCLH: Duty Cycle Register High Half Word
  * @{
  */

#define I2C_SCLH_Mask                  (0xffff)            /*!< Count for SCL High Time          */

/** @} */

/** @defgroup I2C_SCLL_Bit_Definitions SCLL: Duty Cycle Register Low Half Word
  * @{
  */

#define I2C_SCLL_Mask                  (0xffff)            /*!< Count for SCL Low Time           */

/** @} */

/** @defgroup I2C_MMCTRL_Bit_Definitions MMCTRL: Monitor Mode Control Register
  * @{
  */

#define I2C_MMCTRL_Mask                (0x0b)              /*!< Usable Bits in MMCTRL Register   */

#define I2C_MM_ENA                     (1 << 0)            /*!< Monitor Mode Enable              */
#define I2C_ENA_SCL                    (1 << 1)            /*!< SCL Output Enable                */
#define I2C_MATCH_ALL                  (1 << 3)            /*!< Generate Int (in MM) on Any Addr */

/** @} */

/**
  * @}
  */


/** @defgroup WDT_Register_Bit_Definitions WDT Register Bit Definitions
  * @ingroup  WDT
  * @{
  */

/** @addtogroup WDT_MOD_Bit_Definitions MOD: Watchdog Timer Mode Register
  * @{
  */

#define WDT_MOD_Mask                   (0x0f)              /*!< Usable bits in MOD register      */

#define WDT_WDEN                       (1 << 0)            /*!< Watchdog Enable (Set Only)       */
#define WDT_WDRESET                    (1 << 1)            /*!< Watchdog Reset (Set Only)        */
#define WDT_WDTOF                      (1 << 2)            /*!< Watchdog Timeout Flag (SW clear) */
#define WDT_WDINT                      (1 << 3)            /*!< Watchdog Interrupt Flag (RO)     */

#if defined(LPC11XXL)  /* L-series parts have windowed WDT with extra features */
# define WDT_WDPROTECT                 (1 << 4)            /*!< Reload value protection mode     */
#endif

/** @} */

/** @addtogroup WDT_TC_Bit_Definitions TC: Watchdog Timer Constant Register
  * @{
  */

#define WDT_TC_Mask                    (0x00ffffffUL)      /*!< Usable bits in TC register       */

/** @} */

/** @addtogroup WDT_TV_Bit_Definitions TV: Watchdog Timer Value Register
  * @{
  */

#define WDT_TV_Mask                    (0x00ffffffUL)      /*!< Usable bits in TV register       */

/** @} */

#if defined(LPC11XXL)   /* L-series parts have windowed WDT with extra features */
/** @addtogroup WDT_WARNINT_Bit_Definitions WARNINT: Watchdog Timer Warning Interrupt Register
  * @{
  */

#define WDT_WARNINT_Mask               (0x03ff)            /*!< Warning Interrupt Compare Value  */

/** @} */

/** @addtogroup WDT_WINDOW_Bit_Definitions WINDOW: Watchdog Timer Window Timer Register
  * @{
  */

#define WDT_WINDOW_Mask                (0x00ffffffUL)      /*!< Window Value                     */

/** @} */
#endif /* #if defined(LPC11XXL) */

/**
  * @}
  */


/** @defgroup UART_Register_Bit_Definitions UART Register Bit Definitions
  * @ingroup  UART
  * @{
  */

/** @defgroup UART_RBR_Bit_Definitions RBR: Receive Buffer Register
  * @{
  */

#define UART_RBR_Mask                  (0xff)              /*!< Usable bits in RBR register      */

/** @} */

/** @defgroup UART_DLL_Bit_Definitions DLL: Divisor Latch LSB Register
  * @{
  */

#define UART_DLLSB_Mask                (0xff)              /*!< Usable bits in DLLSB register    */

/** @} */

/** @defgroup UART_DLM_Bit_Definitions DLM: Divisor Latch MSB Register
  * @{
  */

#define UART_DLMSB_Mask                (0xff)              /*!< Usable bits in DLMSB register    */

/** @} */

/** @defgroup UART_IER_Bit_Definitions IER: Interrupt Enable Register
  * @{
  */

#define UART_IER_Mask                  (0x0307)            /*!< Usable Bits in IER Register      */

#define UART_RBR_INT_ENA               (1 << 0)            /*!< Rx Data Avail/Timeout IRQ Enable */
#define UART_THRE_INT_ENA              (1 << 1)            /*!< TX Holding Reg Empty IRQ Enable  */
#define UART_LINE_INT_ENA              (1 << 2)            /*!< RX Line Status IRQ Enable        */
#define UART_ABEO_INT_ENA              (1 << 8)            /*!< Auto Baud IRQ Enable             */
#define UART_ABTO_INT_ENA              (1 << 9)            /*!< Auto Baud Timeout IRQ Enable     */

/** @} */

/** @defgroup UART_IIR_Bit_Definitions IIR: Interrupt ID Register
  * @{
  */

#define UART_IIR_Mask                  (0x03cf)            /*!< Usable bits in IIR register    */

#define UART_INTID_Mask                (0x0f)              /*!< Mask for Standard Interrupt ID's */
#define UART_INTID_Shift               (0)                 /*!< Bit shift of INTID Mask          */
#define UART_INTID_NONE                (0x01)              /*!< Int. Status (0 == IT pending)    */
#define UART_INTID_RLS                 (0x06)              /*!< Receive Line Status Interrupt    */
#define UART_INTID_RDA                 (0x04)              /*!< Receive Data Available Interrupt */
#define UART_INTID_CTI                 (0x0c)              /*!< Character Time-out Interrupt     */
#define UART_INTID_THRE                (0x02)              /*!< Tx Holding Reg Empty Interrupt   */
#define UART_INTID_MODM                (0x00)              /*!< Modem Line Interrupt             */

#define UART_FIFO_Mask                 (0x03 << 6)         /*!< Copy of UFCR                     */
#define UART_FIFO_Shift                (6)                 /*!< Bit shift for FIFO Mask          */

#define UART_ABIT_Mask                 (0x03 << 8)         /*!< Mask for Auto Baud Interrupts    */
#define UART_ABIT_Shift                (8)                 /*!< Bit shift of ABIT Mask           */

#define UART_IT_ABEO                   (1 << 8)            /*!< End of Auto-Baud Interrupt       */
#define UART_IT_ABTO                   (1 << 9)            /*!< Auto-Baud Timeout Interrupt      */

/** @} */

/** @defgroup UART_FCR_Bit_Definitions FCR: FIFO Control Register (WO)
  * @{
  */

#define UART_FCR_Mask                  (0xc7)              /*!< Usable bits in FCR register      */

#define UART_RXTRIGLVL_Mask            (3 << 6)            /*!< Mask for RX Trigger Level        */
#define UART_RXTRIGLVL_Shift           (6)                 /*!< Bit shift of RXTRIGLVL Mask      */
#define UART_RXTRIGLVL_1               (0x00)              /*!< Trigger RX IRQ on 1B  in FIFO    */
#define UART_RXTRIGLVL_4               (0x01 << 6)         /*!< Trigger RX IRQ on 4B  in FIFO    */
#define UART_RXTRIGLVL_8               (0x02 << 6)         /*!< Trigger RX IRQ on 8B  in FIFO    */
#define UART_RXTRIGLVL_14              (0x03 << 6)         /*!< Trigger RX IRQ on 14B in FIFO    */

#define UART_FIFOEN                    (1 << 0)            /*!< Enable RX/TX FIFOS (NECESSARY)   */
#define UART_FIFO_RX_RESET             (1 << 1)            /*!< Clear RX FIFO (self-clearing)    */
#define UART_FIFO_TX_RESET             (1 << 2)            /*!< Clear TX FIFO (self-clearing)    */

/** @} */

/** @defgroup UART_LCR_Bit_Definitions LCR: Line Control Register
  * @{
  */

#define UART_LCR_Mask                  (0xff)              /*!< Usable bits in LCR register      */

#define UART_WORDLEN_Mask              (0x03)              /*!< Mask for Word Length             */
#define UART_WORDLEN_Shift             (0)                 /*!< Bit shift of WORDLEN Mask        */
#define UART_WORDLEN_5                 (0x00)              /*!< 5 bit characters                 */
#define UART_WORDLEN_6                 (0x01)              /*!< 6 bit characters                 */
#define UART_WORDLEN_7                 (0x02)              /*!< 7 bit characters                 */
#define UART_WORDLEN_8                 (0x03)              /*!< 8 bit characters                 */

#define UART_PARITY_Mask               (0x07 << 3)         /*!< Mask for Parity Type             */
#define UART_PARITY_Shift              (3)                 /*!< Bit shift of PARITY Mask         */
#define UART_PARITY_NONE               (0x00 << 3)         /*!< No Parity                        */
#define UART_PARITY_ODD                (0x01 << 3)         /*!< Odd Parity                       */
#define UART_PARITY_EVEN               (0x03 << 3)         /*!< Even Parity                      */
#define UART_PARITY_1                  (0x05 << 3)         /*!< Force Parity = 1                 */
#define UART_PARITY_0                  (0x07 << 3)         /*!< Force Parity = 0                 */

#define UART_2STOPBITS                 (1 << 2)            /*!< 2 stop bits                      */
#define UART_PAREN                     (1 << 3)            /*!< Enable Parity                    */
#define UART_BREAK                     (1 << 6)            /*!< Set BREAK on TX line             */
#define UART_DLAB                      (1 << 7)            /*!< Enable Access to Div Latch       */

/** @} */

/** @defgroup UART_MCR_Bit_Definitions MCR: Modem Control Register
  * @{
  */

#define UART_MCR_Mask                  (0xd3)              /*!< Usable bits in MCR register      */

