coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
#define UART_DTR                       (1 << 0)            /*!< Control of /DTR line             */
#define UART_RTS                       (1 << 1)            /*!< Control of /RTS line             */
#define UART_LOOPBACK                  (1 << 4)            /*!< Enable Loopback Mode             */
#define UART_RTSENA                    (1 << 6)            /*!< Enable Auto-RTS Flow Control     */
#define UART_CTSENA                    (1 << 7)            /*!< Enable Auto-CTS Flow Control     */

/** @} */

/** @defgroup UART_LSR_Bit_Definitions LSR: Line Status Register
  * @{
  */

#define UART_LSR_Mask                  (0xff)              /*!< Usable bits in LSR register      */

#define UART_RDR                       (1 << 0)            /*!< Receiver Data Ready              */
#define UART_OE                        (1 << 1)            /*!< Overrun Error                    */
#define UART_PE                        (1 << 2)            /*!< Parity Error                     */
#define UART_FE                        (1 << 3)            /*!< Framing Error                    */
#define UART_BI                        (1 << 4)            /*!< Break Interrupt                  */
#define UART_THRE                      (1 << 5)            /*!< Tx Holding Register Empty        */
#define UART_TEMT                      (1 << 6)            /*!< Transmitter Empty                */
#define UART_RXFE                      (1 << 7)            /*!< Error in RX FIFO                 */

/** @} */

/** @defgroup UART_MSR_Bit_Definitions MSR: Modem Status Register
  * @{
  */

#define UART_MSR_Mask                  (0xff)              /*!< Usable bits in MSR register      */

#define UART_DCTS                      (1 << 0)            /*!< Change in CTS                    */
#define UART_DDSR                      (1 << 1)            /*!< Change in DSR                    */
#define UART_TERI                      (1 << 2)            /*!< Low-to-high on RI                */
#define UART_DDCD                      (1 << 3)            /*!< Change on DCD                    */
#define UART_CTS                       (1 << 4)            /*!< Current CTS State (inverted)     */
#define UART_DSR                       (1 << 5)            /*!< Current DSR State (inverted)     */
#define UART_RI                        (1 << 6)            /*!< Current RI State (inverted)      */
#define UART_DCD                       (1 << 7)            /*!< Current DCD State (inverted)     */

/** @} */

/** @defgroup UART_ACR_Bit_Definitions ACR: Auto-baud Control Register
  * @{
  */

#define UART_ACR_Mask                  (0x0307)            /*!< Usable bits in ACR register      */

#define UART_AUTOBAUD                  (1 << 0)            /*!< Autobaud Running                 */
#define UART_MODE1                     (1 << 1)            /*!< Mode 1 Selected (0 = Mode 0)     */
#define UART_AUTORESTART               (1 << 2)            /*!< Autobaud Restart on Timeout      */
#define UART_ABEOIRQCLR                (1 << 8)            /*!< Clear ABEO Interrupt             */
#define UART_ABTOIRQCLR                (1 << 9)            /*!< Clear ABTO Interrupt             */

/** @} */

/** @defgroup UART_FDR_Bit_Definitions FDR: Fractional Divider Register
  * @{
  */

#define UART_FDR_Mask                  (0xff)              /*!< Usable bits in FDR register      */

#define UART_DIVADDVAL_Mask            (0x0f)              /*!< Fractional Divider Div. Val Mask */
#define UART_DIVADDVAL_Shift           (0)                 /*!< Bit shift of DIVADDVAL Mask      */

#define UART_MULVAL_Mask               (0x0f << 4)         /*!< Fract. Divider Mult. Val Mask    */
#define UART_MULVAL_Shift              (4)                 /*!< Bit shift of MULVAL Mask         */

/** @} */

/** @defgroup UART_TER_Bit_Definitions TER: Transmit Enable Register
  * @{
  */

#define UART_TXEN                      (1 << 7)            /*!< Enable Transmitter               */

/** @} */

/** @defgroup UART_RS485CTRL_Bit_Definitions RS485CTRL: RS485-Mode Control Register
  * @{
  */

#define UART_RS485CTRL_Mask            (0x3f)              /*!< Usable bits in RS485CTRL reg.    */

#define UART_NMMEN                     (1 << 0)            /*!< Enable RS/EIA485 Multidrop Mode  */
#define UART_RXDIS                     (1 << 1)            /*!< Disable Receiver                 */
#define UART_AADEN                     (1 << 2)            /*!< Enable RS/EIA485 Auto Addr Det.  */
#define UART_DIRSEL                    (1 << 3)            /*!< 0=RTS Dir Ctrl, 1=DTR Dir Ctrl   */
#define UART_DCTRL                     (1 << 4)            /*!< Enable Direction Control         */
#define UART_OINV                      (1 << 5)            /*!< Invert Polarity on Dir Ctrl Pin  */

/** @} */

/** @defgroup UART_RS485ADRMATCH_Bit_Definitions RS485ADRMATCH: RS485-Mode Address Match Register
  * @{
  */

#define UART_RS485ADRMATCH_Mask        (0xff)              /*!< Usable bits in RS485ADRMATCH reg */

/** @} */

/** @defgroup UART_RS485DLY_Bit_Definitions RS485DLY: RS485-Mode Delay Register
  * @{
  */

#define UART_RS485DLY_Mask             (0xff)              /*!< Usable bits in RS485DLY register */

/** @} */

/**
  * @}
  */


/** @defgroup ADC_Register_Bit_Definitions ADC Register Bit Definitions
  * @ingroup ADC
  * @{
  */

/** @defgroup ADC_CR0_Bit_Definitions CR0: Control Register 0
  * @{
  */

#define ADC_CR0_Mask                   (0x00ffffffUL)      /*!< Usable bits in CR0 register      */

#define ADC_SEL_Mask                   (0xffUL)            /*!< ADC Channel Selection Mask       */
#define ADC_SEL_Shift                  (0)                 /*!< Bit shift of SEL Mask            */
#define ADC_SEL_0                      (1 << 0)            /*!< Select AD0 for Conversion        */
#define ADC_SEL_1                      (1 << 1)            /*!< Select AD1 for Conversion        */
#define ADC_SEL_2                      (1 << 2)            /*!< Select AD2 for Conversion        */
#define ADC_SEL_3                      (1 << 3)            /*!< Select AD3 for Conversion        */
#define ADC_SEL_4                      (1 << 4)            /*!< Select AD4 for Conversion        */
#define ADC_SEL_5                      (1 << 5)            /*!< Select AD5 for Conversion        */
#define ADC_SEL_6                      (1 << 6)            /*!< Select AD6 for Conversion        */
#define ADC_SEL_7                      (1 << 7)            /*!< Select AD7 for Conversion        */

#define ADC_CLKDIV_Mask                (0xffUL << 8)       /*!< ADC Clock Divisor Mask           */
#define ADC_CLKDIV_Shift               (8)                 /*!< Bit shift of CLKDIV Mask         */

#define ADC_CLKS_Mask                  (0x07UL << 17)      /*!< ADC # Clocks / Burst Conversion  */
#define ADC_CLKS_Shift                 (17)                /*!< Bit shift of CLKS Mask           */

#define ADC_START_Mask                 (0x07UL << 24)      /*!< Start Mode Mask                  */
#define ADC_START_Shift                (24)                /*!< Bit shift of START Mask          */

#define ADC_BURST                      (1UL << 16)         /*!< Enable "Burst Mode" (HW scan)    */
#define ADC_EDGE                       (1UL << 27)         /*!< Set Edge for Capture Mode        */

/** @} */

/** @defgroup ADC_DR_Bit_Definitions DR: Data Registers (and GDR: Global Data Register)
  * @{
  */

#define ADC_GDR_Mask                   (0xc700ffffUL)      /*!< Usable bits in GDR register      */

#define ADC_V_VREF_Mask                (0xffffUL)          /*!< Result of ADC Conversion         */
#define ADC_V_VREF_Shift               (0)                 /*!< Bit shift of V_VREF Mask         */

