coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
#define ADC_CHN_Mask                   (0x07UL << 24)      /*!< Channel Result Came From         */
#define ADC_CHN_Shift                  (24)                /*!< Bit shift of CHN Mask            */

#define ADC_OVERRUN                    (1UL << 30)         /*!< Result Overwritten Flag          */
#define ADC_DONE                       (1UL << 31)         /*!< Conversion Done Flag             */

/** @} */

/** @defgroup ADC_STAT_Bit_Definitions STAT: Status Register
  * @{
  */

#define ADC_STAT_Mask                  (0x0001ffffUL)      /*!< Usable bits in STAT register     */

#define ADC_STATDONE_Mask              (0xffUL)            /*!< "DONE" Flags Mask                */
#define ADC_STATDONE_Shift             (0)                 /*!< Bit shift of STATDONE Mask       */
#define ADC_STATDONE_0                 (1UL << 0)          /*!< Channel 0 Done Flag              */
#define ADC_STATDONE_1                 (1UL << 1)          /*!< Channel 1 Done Flag              */
#define ADC_STATDONE_2                 (1UL << 2)          /*!< Channel 2 Done Flag              */
#define ADC_STATDONE_3                 (1UL << 3)          /*!< Channel 3 Done Flag              */
#define ADC_STATDONE_4                 (1UL << 4)          /*!< Channel 4 Done Flag              */
#define ADC_STATDONE_5                 (1UL << 5)          /*!< Channel 5 Done Flag              */
#define ADC_STATDONE_6                 (1UL << 6)          /*!< Channel 6 Done Flag              */
#define ADC_STATDONE_7                 (1UL << 7)          /*!< Channel 7 Done Flag              */

#define ADC_STATOVERRUN_Mask           (0xffUL << 8)       /*!< "OVERRUN" Flags Mask             */
#define ADC_STATOVERRUN_Shift          (8)                 /*!< Bit shift of STATOVERRUN Mask    */
#define ADC_STATOVERRUN_0              (1UL << 8)          /*!< Channel 0 Overrun Flag           */
#define ADC_STATOVERRUN_1              (1UL << 9)          /*!< Channel 1 Overrun Flag           */
#define ADC_STATOVERRUN_2              (1UL << 10)         /*!< Channel 2 Overrun Flag           */
#define ADC_STATOVERRUN_3              (1UL << 11)         /*!< Channel 3 Overrun Flag           */
#define ADC_STATOVERRUN_4              (1UL << 12)         /*!< Channel 4 Overrun Flag           */
#define ADC_STATOVERRUN_5              (1UL << 13)         /*!< Channel 5 Overrun Flag           */
#define ADC_STATOVERRUN_6              (1UL << 14)         /*!< Channel 6 Overrun Flag           */
#define ADC_STATOVERRUN_7              (1UL << 15)         /*!< Channel 7 Overrun Flag           */

#define ADC_ADINT                      (1UL << 16)         /*!< Interrupt Flag                   */

/** @} */

/** @defgroup ADC_INTEN_Bit_Definitions INTEN: Interrupt Enable Register
  * @{
  */

#define ADC_INTEN_Mask                 (0x01ff)            /*!< Usable bits in INTEN register    */

#define ADC_ADINTEN_Mask               (0xff)              /*!< Enable Channel Interrupts Mask   */
#define ADC_ADINTEN_Shift              (0)                 /*!< Bit shift of ADINTEN Mask        */
#define ADC_ADINTEN_0                  (1 << 0)            /*!< Enable Interrupt on Channel 0    */
#define ADC_ADINTEN_1                  (1 << 1)            /*!< Enable Interrupt on Channel 1    */
#define ADC_ADINTEN_2                  (1 << 2)            /*!< Enable Interrupt on Channel 2    */
#define ADC_ADINTEN_3                  (1 << 3)            /*!< Enable Interrupt on Channel 3    */
#define ADC_ADINTEN_4                  (1 << 4)            /*!< Enable Interrupt on Channel 4    */
#define ADC_ADINTEN_5                  (1 << 5)            /*!< Enable Interrupt on Channel 5    */
#define ADC_ADINTEN_6                  (1 << 6)            /*!< Enable Interrupt on Channel 6    */
#define ADC_ADINTEN_7                  (1 << 7)            /*!< Enable Interrupt on Channel 7    */

#define ADC_ADGINTEN                   (1 << 8)            /*!< Enable ADC Global Interrupt      */

/** @} */

/**
  * @}
  */


/** @defgroup PMU_Register_Bit_Definitions PMU Register Bit Definitions
  * @ingroup  PMU
  * @{
  */

/** @defgroup PMU_PCON_Bit_Definitions PCON: Power Configuration Register
  * @{
  */

#define PMU_PCON_Mask                  (0x902)             /*!< Usable bits in PMU PCON register */

#define PMU_DPDEN                      (1 << 1)            /*!< Enable Deep Power Down on WFI    */
#define PMU_SLEEPFLAG                  (1 << 8)            /*!< Power Down Mode Entered Flag     */
#define PMU_DPDFLAG                    (1 << 11)           /*!< Deep Power Down Mode Flag        */

/** @} */

/** @defgroup PMU_GPREG4_Bit_Definitions GPREG4: General Purpose Register 4 / Wakeup Hysteresis Control Register
  * @{
  */

#define PMU_WAKEUPHYS                  (1 << 10)           /*!< Enable Hysteresis on Wakeup Pin  */

/** @} */

/**
  * @}
  */


/** @defgroup FLASH_Register_Bit_Definitions FLASH Register Bit Definitions
  * @ingroup  FLASH
  * @{
  */

/** @defgroup FLASH_FLASHCFG_Bit_Definitions FLASHCFG: Flash Configuration Register
  * @{
  */

#define FLASH_FLASHTIM_Mask            (0x03)              /*!< Mask for Setting Flash Timing    */
#define FLASH_FLASHTIM_1               (0x00)              /*!< Flash Accesses take 1 Sys Clock  */
#define FLASH_FLASHTIM_2               (0x01)              /*!< Flash Accesses take 2 Sys Clocks */
#define FLASH_FLASHTIM_3               (0x02)              /*!< Flash Accesses take 3 Sys Clocks */

/** @} */

/** @defgroup FLASH_FMSSTART_Bit_Definitions FMSSTART: Flash Module Signature Start Register
  * @{
  */

#define FLASH_START_Mask               (0xffff)            /*!< Mask / Signature Gen Start Addr  */

/** @} */

/** @defgroup FLASH_FMSSTOP_Bit_Definitions FMSSTOP: Flash Module Signature Stop Register
  * @{
  */

#define FLASH_STOP_Mask                (0xffff)            /*!< Mask / Signature Gen Stop Addr   */
#define FLASH_SIG_START                (1 << 17)           /*!< Start Signature Generation Flag  */

/** @} */

/** @defgroup FLASH_FMSTAT_Bit_Definitions FMSTAT: Flash Module Status Register
  * @{
  */

#define FLASH_SIG_DONE                 (1 << 2)            /*!< Signature Generation Completed   */

/** @} */

/** @defgroup FLASH_FMSTATCLR_Bit_Definitions FMSTATCLR: Flash Module Status Register Clear
  * @{
  */

#define FLASH_SIG_DONE_CLR             (1 << 2)            /*!< Clear Signature Gen Complete Flg */

/** @} */


/**
  * @}
  */


/** @defgroup SSP_Register_Bit_Definitions SSP Register Bit Definitions
  * @ingroup  SSP
  * @{
  */

/** @defgroup SSP_CR0_Bit_Definitions CR0: Control Register 0
  * @{
  */

#define SSP_CR0_Mask                   (0xffff)            /*!< Usable bits in CR0 register      */

#define SSP_DSS_Mask                   (0x0f)              /*!< SSP Data Size Select Mask        */
#define SSP_DSS_Shift                  (0)                 /*!< Bit shift of DSS Mask            */
#define SSP_DSS_4                      (0x03)              /*!< 4-bit  Data Size                 */
#define SSP_DSS_5                      (0x04)              /*!< 5-bit  Data Size                 */
#define SSP_DSS_6                      (0x05)              /*!< 6-bit  Data Size                 */
#define SSP_DSS_7                      (0x06)              /*!< 7-bit  Data Size                 */
#define SSP_DSS_8                      (0x07)              /*!< 8-bit  Data Size                 */
#define SSP_DSS_9                      (0x08)              /*!< 9-bit  Data Size                 */
#define SSP_DSS_10                     (0x09)              /*!< 10-bit Data Size                 */
#define SSP_DSS_11                     (0x0a)              /*!< 11-bit Data Size                 */
#define SSP_DSS_12                     (0x0b)              /*!< 12-bit Data Size                 */
#define SSP_DSS_13                     (0x0c)              /*!< 13-bit Data Size                 */
#define SSP_DSS_14                     (0x0d)              /*!< 14-bit Data Size                 */
#define SSP_DSS_15                     (0x0e)              /*!< 15-bit Data Size                 */
#define SSP_DSS_16                     (0x0f)              /*!< 16-bit Data Size                 */

#define SSP_FRF_Mask                   (0x03 << 4)         /*!< Frame Format Bitmask             */
#define SSP_FRF_Shift                  (4)                 /*!< Bit shift of FRF Mask            */
#define SSP_FRF_SPI                    (0x00)              /*!< SPI Frame Format                 */
#define SSP_FRF_TI                     (0x01 << 4)         /*!< TI Frame Format                  */
#define SSP_FRF_MICROWIRE              (0x02 << 4)         /*!< Microwire Frame Format           */

/* Bit Frequency is PCLK / (CPSDVSR * (SCR + 1)) */

#define SSP_SCR_Mask                   (0xff << 8)         /*!< Serial Clock Data Rate Mask      */
#define SSP_SCR_Shift                  (8)                 /*!< Bit shift of SCR Mask            */

#define SSP_CPOL                       (1 << 6)            /*!< Clock Polarity Hi Btwn Frames    */
#define SSP_CPHA                       (1 << 7)            /*!< Latch Bits on 2nd Edge           */

/** @} */

/** @defgroup SSP_CR1_Bit_Definitions CR1: Control Register 1
  * @{
  */

#define SSP_CR1_Mask                   (0x0f)              /*!< Usable bits in CR1 register      */

#define SSP_CR1_MODE_Mask              (0x0c)              /*!< SSP Mode Mask                    */
#define SSP_CR1_MODE_Shift             (0)                 /*!< Bit shift of CR1_MODE Mask       */

#define SSP_LBM                        (1 << 0)            /*!< Loop Back Mode Enable            */
#define SSP_SSE                        (1 << 1)            /*!< SSP Peripheral Enable            */
#define SSP_MS                         (1 << 2)            /*!< Slave Mode Enable                */
#define SSP_SOD                        (1 << 3)            /*!< Disable Slave Mode Output        */

/** @} */

/** @defgroup SSP_SR_Bit_Definitions SR: Status Register
  * @{
  */

#define SSP_SR_Mask                    (0x1f)              /*!< Usable bits in SR register       */

