coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
#define SSP_TFE                        (1 << 0)            /*!< Transmit FIFO Empty Flag         */
#define SSP_TNF                        (1 << 1)            /*!< Transmit FIFO Not Full Flag      */
#define SSP_RNE                        (1 << 2)            /*!< Receive FIFO Not Empty Flag      */
#define SSP_RFF                        (1 << 3)            /*!< Receive FIFO Full Flag           */
#define SSP_BSY                        (1 << 4)            /*!< SPI Controller Busy Flag         */

/** @} */

/** @defgroup SSP_IMSC_Bit_Definitions IMSC: Interrupt Mask Set/Clear Register
  * @{
  */

#define SSP_IMSC_Mask                  (0x0f)              /*!< Usable bits in IMSC register     */

#define SSP_RORIM                      (1 << 0)            /*!< Receive Overrun IRQ Enable       */
#define SSP_RTIM                       (1 << 1)            /*!< Receive Timeout IRQ Enable       */
#define SSP_RXIM                       (1 << 2)            /*!< Rx FIFO > 1/2 Full IRQ Enable    */
#define SSP_TXIM                       (1 << 3)            /*!< Tx FIFO at least 1/2 Empty       */

/** @} */

/** @defgroup SSP_RIS_Bit_Definitions RIS: Raw Interrupt Status Register
  * @{
  */

#define SSP_RIS_Mask                   (0x0f)              /*!< Usable bits in RIS register     */

#define SSP_RORRIS                     (1 << 0)            /*!< Raw Receive Overrun IRQ          */
#define SSP_RTRIS                      (1 << 1)            /*!< Raw Receive Timeout IRQ          */
#define SSP_RXRIS                      (1 << 2)            /*!< Raw Rx FIFO > 1/2 Full IRQ       */
#define SSP_TXRIS                      (1 << 3)            /*!< Raw Tx FIFO at least 1/2         */

/** @} */

/** @defgroup SSP_MIR_Bit_Definitions MIR: Masked Interrupt Status Register
  * @{
  */

#define SSP_MIR_Mask                   (0x0f)              /*!< Usable bits in MIR register     */

#define SSP_RORMIS                     (1 << 0)            /*!< Rx Overrun Interrupt Pending     */
#define SSP_RTMIS                      (1 << 2)            /*!< Rx Timeout Interrupt Pending     */
#define SSP_RXMIS                      (1 << 3)            /*!< Rx Fifo Half Full Int Pending    */
#define SSP_TXMIS                      (1 << 4)            /*!< Tx Fifo Half Empty Int Pending   */

/** @} */

/** @defgroup SSP_ICR_Bit_Definitions ICR: Interrupt Clear Register
  * @{
  */

#define SSP_ICR_Mask                   (0x03)              /*!< Usable bits in ICR register     */

#define SSP_RORIC                      (1 << 0)            /*!< Clear Receive Overrun Interrupt  */
#define SSP_RTIC                       (1 << 1)            /*!< Clear Receive Timeout Interrupt  */

/** @} */

/**
  * @}
  */


/** @defgroup IOCON_Register_Bit_Definitions IOCON Register Bit Definitions
  * @ingroup  IOCON
  * @{
  */

/** @defgroup IOCON_PIOn_Bit_Definitions PIOn: IO Configuration Registers
  * @{
  */

#define IOCON_PIO_Mask                 (0x03bf)            /*!< Usable bits in PIO register      */

#define IOCON_FUNC_Mask                (0x07)              /*!< Pin Function Mask                */
#define IOCON_FUNC_Shift               (0)                 /*!< Bit shift of FUNC Mask           */

#define IOCON_MODE_Mask                (0x03 << 3)         /*!< Pin Mode Mask                    */
#define IOCON_MODE_Shift               (3)                 /*!< Bit shift of MODE Mask           */
#define IOCON_MODE_INACTIVE            (0x00)              /*!< No Pullup / Pulldown             */
#define IOCON_MODE_PULLDOWN            (0x01 << 3)         /*!< Pulldown Resistor Enabled        */
#define IOCON_MODE_PULLUP              (0x02 << 3)         /*!< Pullup Resistor Enabled          */
#define IOCON_MODE_REPEATER            (0x03 << 3)         /*!< Repeater Mode                    */

#define IOCON_I2C_Mask                 (0x03 << 8)         /*!< Pin I2C Setting Mask             */
#define IOCON_I2C_Shift                (8)                 /*!< Bit shift of I2C Mask            */
#define IOCON_I2C_I2C                  (0x00)              /*!< Standard I2C                     */
#define IOCON_I2C_GPIO                 (0x01 << 8)         /*!< Standard GPIO                    */
#define IOCON_I2C_FASTPLUS             (0x02 << 8)         /*!< FastPlus I2C                     */

#define IOCON_HYS                      (1 << 5)            /*!< Enable Hysteresis                */
#define IOCON_AD                       (1 << 7)            /*!< Enable Analog Mode               */

#if defined(LPC11XXL)  /* L-series parts only */
# define IOCON_OD                      (1 << 10)           /*!< Enable pseudo Open-Drain Mode    */
#endif

/** @} */

/** @defgroup IOCON_LOC_Bit_Definitions SCK0_LOC/RI0_LOC/etc: Pin Location Configuration Registers
  * @{
  */

#define IOCON_LOC_Mask                 (0x03)              /*!< Pin Location Mask                */

/** @} */

/**
  * @}
  */


/** @defgroup SYSCON_Register_Bit_Definitions SYSCON Register Bit Definitions
  * @ingroup  SYSCON
  * @{
  */

/* Note: Naming here adds the register name since SYSCON combines so many
 * different functions
 */

/** @defgroup SYSCON_SYSMEMREMAP_Bit_Definitions SYSMEMREMAP: Memory Remapping Register
  * @{
  */

#define SYSCON_SYSMEMREMAP_MAP_Mask       (0x03)           /*!< Memory Remap Bit Mask            */
#define SYSCON_SYSMEMREMAP_MAP_BOOTLOADER (0x00)           /*!< Map Bootloader ROM into Sys Mem  */
#define SYSCON_SYSMEMREMAP_MAP_RAM        (0x01)           /*!< Map RAM into System Memory       */
#define SYSCON_SYSMEMREMAP_MAP_FLASH      (0x02)           /*!< Map FLASH into System Memory     */

/** @} */

/** @defgroup SYSCON_PRESETCTRL_Bit_Definitions PRESETCTRL: Peripheral Reset Control Register
  * @{
  */

#if defined(LPC11CXX)  /* CAN Parts only */
# define SYSCON_PRESETCTRL_RESET_Mask  (0x0f)              /*!< Peripheral Reset Mask            */
#else
# define SYSCON_PRESETCTRL_RESET_Mask  (0x07)              /*!< Peripheral Reset Mask            */
#endif

#define SYSCON_PRESETCTRL_SSP0_RST_N   (1 << 0)            /*!< Reset SSP0 Peripheral            */
#define SYSCON_PRESETCTRL_I2C0_RST_N   (1 << 1)            /*!< Reset I2C0 Peripheral            */
#define SYSCON_PRESETCTRL_SSP1_RST_N   (1 << 2)            /*!< Reset SSP1 Peripheral            */

#if defined(LPC11CXX)  /* CAN Parts only */
# define SYSCON_PRESETCTRL_CAN0_RST_N  (1 << 3)            /*!< Reset CAN0 Peripheral            */
#endif

/** @} */

/** @defgroup SYSCON_SYSPLLCTRL_Bit_Definitions SYSPLLCTRL: System PLL Control Register
  * @{
  */

#define SYSCON_SYSPLLCTRL_Mask         (0x7f)              /*!< Usable bits in SYSPLLCTRL reg.   */

#define SYSCON_SYSPLLCTRL_MSEL_Mask    (0x1f)              /*!< SysPLL Feedback Divider Mask     */
#define SYSCON_SYSPLLCTRL_MSEL_Shift   (0)                 /*!< Bit shift / SYSPLLCTRL_MSEL Mask */

#define SYSCON_SYSPLLCTRL_PSEL_Mask    (0x03 << 5)         /*!< SysPLL Post Divider Ratio Mask   */
#define SYSCON_SYSPLLCTRL_PSEL_Shift   (5)                 /*!< Bit shift / SYSPLLCTRL_PSEL Mask */
#define SYSCON_SYSPLLCTRL_PSEL_DIV2    (0x00 << 5)         /*!< Post-Divide by 2                 */
#define SYSCON_SYSPLLCTRL_PSEL_DIV4    (0x01 << 5)         /*!< Post-Divide by 4                 */
#define SYSCON_SYSPLLCTRL_PSEL_DIV8    (0x02 << 5)         /*!< Post-Divide by 8                 */
#define SYSCON_SYSPLLCTRL_PSEL_DIV16   (0x03 << 5)         /*!< Post-Divide by 16                */

/** @} */

