coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
/** @defgroup SYSCON_SYSPLLSTAT_Bit_Definitions SYSPLLSTAT: System PLL Status Register
  * @{
  */

#define SYSCON_SYSPLLSTAT_LOCKED       (1 << 0)            /*!< (RO) System PLL is Locked Flag   */

/** @} */

/** @defgroup SYSCON_IRCCTL_Bit_Definitions IRCCTL: Internal RC Clock Control Register
  * @{
  */

#define SYSCON_IRCCTL_TRIM_Mask        (0xff)              /*!< Usable bits in IRCCTL register   */

/** @} */

/** @defgroup SYSCON_SYSOSCCTRL_Bit_Definitions SYSOSCCTRL: System Oscillator Control Register
  * @{
  */

#define SYSCON_SYSOSCCTRL_Mask         (0x03)              /*!< Useable bits in SYSOSCCTRL reg.  */
#define SYSCON_SYSOSCCTRL_BYPASS       (1 << 0)            /*!< Bypass the System Oscillator     */
#define SYSCON_SYSOSCCTRL_FREQRANGE    (1 << 1)            /*!< External Xtal Frequency 15-25Mhz */

/** @} */

/** @defgroup SYSCON_WDTOSCCTL_Bit_Definitions WDTOSCCTL: Watchdog Timer Oscillator Control Register
  * @{
  */

#define SYSCON_WDTOSCCTL_Mask           (0x01ff)           /*!< Usable bits in WDTOSCCTL reg.    */

#define SYSCON_WDTOSCCTRL_DIV_Mask      (0x1f)             /*!< WDT Oscillator Divider Value     */
#define SYSCON_WDTOSCCTRL_DIV_Shift     (0)                /*!< Bit shift of WDTOSCCTRL_DIV Mask */

#define SYSCON_WDTOSCCTRL_FREQSEL_Mask  (0x01e0)           /*!< WDT Oscillator Frequency Mask    */
#define SYSCON_WDTOSCCTRL_FREQSEL_Shift (5)                /*!< Shift of WDTOSCCTRL_FREQSEL Mask */
#define SYSCON_WDTOSCCTRL_FREQSEL_0_5   (0x01 << 5)        /*!< WDT Oscillator 0.5 Mhz           */
#define SYSCON_WDTOSCCTRL_FREQSEL_0_8   (0x02 << 5)        /*!< WDT Oscillator 0.8 Mhz           */
#define SYSCON_WDTOSCCTRL_FREQSEL_1_1   (0x03 << 5)        /*!< WDT Oscillator 1.1 Mhz           */
#define SYSCON_WDTOSCCTRL_FREQSEL_1_4   (0x04 << 5)        /*!< WDT Oscillator 1.4 Mhz           */
#define SYSCON_WDTOSCCTRL_FREQSEL_1_6   (0x05 << 5)        /*!< WDT Oscillator 1.6 Mhz           */
#define SYSCON_WDTOSCCTRL_FREQSEL_1_8   (0x06 << 5)        /*!< WDT Oscillator 1.8 Mhz           */
#define SYSCON_WDTOSCCTRL_FREQSEL_2_0   (0x07 << 5)        /*!< WDT Oscillator 2.0 Mhz           */
#define SYSCON_WDTOSCCTRL_FREQSEL_2_2   (0x08 << 5)        /*!< WDT Oscillator 2.2 Mhz           */
#define SYSCON_WDTOSCCTRL_FREQSEL_2_4   (0x09 << 5)        /*!< WDT Oscillator 2.4 Mhz           */
#define SYSCON_WDTOSCCTRL_FREQSEL_2_6   (0x0a << 5)        /*!< WDT Oscillator 2.6 Mhz           */
#define SYSCON_WDTOSCCTRL_FREQSEL_2_7   (0x0b << 5)        /*!< WDT Oscillator 2.7 Mhz           */
#define SYSCON_WDTOSCCTRL_FREQSEL_2_9   (0x0c << 5)        /*!< WDT Oscillator 2.9 Mhz           */
#define SYSCON_WDTOSCCTRL_FREQSEL_3_1   (0x0d << 5)        /*!< WDT Oscillator 3.1 Mhz           */
#define SYSCON_WDTOSCCTRL_FREQSEL_3_2   (0x0e << 5)        /*!< WDT Oscillator 3.2 Mhz           */
#define SYSCON_WDTOSCCTRL_FREQSEL_3_4   (0x0f << 5)        /*!< WDT Oscillator 3.4 Mhz           */

/** @} */

/** @defgroup SYSCON_SYSRESSTAT_Bit_Definitions SYSRESSTAT: System Reset Source Status Register
  * @{
  */

#define SYSCON_SYSRESSTAT_STAT_Mask    (0x1f)              /*!< System Reset Source Mask         */
#define SYSCON_SYSRESSTAT_STAT_POR     (1 << 0)            /*!< Reset was from Power-On Reset    */
#define SYSCON_SYSRESSTAT_STAT_EXTRST  (1 << 1)            /*!< Reset was from External Reset    */
#define SYSCON_SYSRESSTAT_STAT_WDT     (1 << 2)            /*!< Reset was from Watchdog          */
#define SYSCON_SYSRESSTAT_STAT_BOD     (1 << 3)            /*!< Reset was from Brownout          */
#define SYSCON_SYSRESSTAT_STAT_SYSRST  (1 << 4)            /*!< Reset was from NVIC Reset        */

/** @} */

/** @defgroup SYSCON_SYSPLLCLKSEL_Bit_Definitions SYSPLLCLKSEL: System PLL Clock Select Register
  * @{
  */

#define SYSCON_SYSPLLCLKSEL_Mask       (0x03)              /*!< System PLL Clock Select Mask     */

#define SYSCON_SYSPLLCLKSEL_IRC        (0x00)              /*!< System PLL Fed from Internal RC  */
#define SYSCON_SYSPLLCLKSEL_SYSOSC     (0x01)              /*!< System PLL Fed from Sys Osc.     */

/** @} */

/** @defgroup SYSCON_SYSPLLUEN_Bit_Definitions SYSPLLUEN: System PLL Source Update Enable Register
  * @{
  */

#define SYSCON_SYSPLLUEN_ENA           (1 << 0)            /*!< Enable System PLL Source Update  */

/** @} */

/** @defgroup SYSCON_MAINCLKSEL_Bit_Definitions MAINCLKSEL: Main Clock Select Register
  * @{
  */

#define SYSCON_MAINCLKSEL_Mask         (0x03)              /*!< Main Clock Source Select Mask    */
#define SYSCON_MAINCLKSEL_IRC          (0x00)              /*!< Main Clock Fed from Internal RC  */
#define SYSCON_MAINCLKSEL_SYSPLLIN     (0x01)              /*!< Main Clock Fed from Sys PLL IN   */
#define SYSCON_MAINCLKSEL_WDTOSC       (0x02)              /*!< Main Clock Fed from WDT Osc.     */
#define SYSCON_MAINCLKSEL_SYSPLLOUT    (0x03)              /*!< Main Clock Fed from Sys PLL Out  */

/** @} */

/** @defgroup SYSCON_MAINCLKUEN_Bit_Definitions MAINCLKUEN: Main Clock Source Update Enable Register
  * @{
  */

#define SYSCON_MAINCLKUEN_ENA          (1 << 0)            /*!< Enable Update of Main Clock Src  */

/** @} */

/** @defgroup SYSCON_SYSAHBCLKDIV_Bit_Definitions SYSAHBCLKDIV: System AHB Clock Divider Register
  * @{
  */

#define SYSCON_SYSAHBCLKDIV_Mask       (0xff)              /*!< Usable bits in SYSAHBCLKDIV reg. */

/** @} */

/** @defgroup SYSCON_SYSAHBCLKCTRL_Bit_Definitions SYSAHBCLKCTRL: System AHB Clock Control Register
  * @{
  */

#define SYSCON_SYSAHBCLKCTRL_Mask       (0x0003ffffUL)     /*!< AHB Clock Control Mask           */
#define SYSCON_SYSAHBCLKCTRL_SYS        (1 << 0)           /*!< (RO) Main System Clock Enabled   */
#define SYSCON_SYSAHBCLKCTRL_ROM        (1 << 1)           /*!< Enable AHB clock to System ROM   */
#define SYSCON_SYSAHBCLKCTRL_RAM        (1 << 2)           /*!< Enable AHB clock to System RAM   */
#define SYSCON_SYSAHBCLKCTRL_FLASHREG   (1 << 3)           /*!< Enable AHB clock to Flash CTRL   */
#define SYSCON_SYSAHBCLKCTRL_FLASHARRAY (1 << 4)           /*!< Enable AHB clock to system FLASH */
#define SYSCON_SYSAHBCLKCTRL_I2C0       (1 << 5)           /*!< Enable AHB clock to I2C0 Periph. */
#define SYSCON_SYSAHBCLKCTRL_GPIO       (1 << 6)           /*!< Enable AHB clock to GPIO Periph. */
#define SYSCON_SYSAHBCLKCTRL_CT16B0     (1 << 7)           /*!< Enable AHB clock to 16b Timer 0  */
#define SYSCON_SYSAHBCLKCTRL_CT16B1     (1 << 8)           /*!< Enable AHB clock to 16b Timer 1  */
#define SYSCON_SYSAHBCLKCTRL_CT32B0     (1 << 9)           /*!< Enable AHB clock to 32b Timer 0  */
#define SYSCON_SYSAHBCLKCTRL_CT32B1     (1 << 10)          /*!< Enable AHB clock to 32b Timer 1  */
#define SYSCON_SYSAHBCLKCTRL_SSP0       (1 << 11)          /*!< Enable AHB clock to SSP0 Periph. */
#define SYSCON_SYSAHBCLKCTRL_UART0      (1 << 12)          /*!< Enable AHB clock to UART0 Periph */
#define SYSCON_SYSAHBCLKCTRL_ADC0       (1 << 13)          /*!< Enable AHB clock to ADC0         */
#define SYSCON_SYSAHBCLKCTRL_WDT        (1 << 15)          /*!< Enable AHB clock to Watchdog Tmr */
#define SYSCON_SYSAHBCLKCTRL_IOCON      (1 << 16)          /*!< Enable AHB clock to IO Config    */
#define SYSCON_SYSAHBCLKCTRL_CAN0       (1 << 17)          /*!< Enable AHB clock to CAN Periph.  */
#define SYSCON_SYSAHBCLKCTRL_SSP1       (1 << 18)          /*!< Enable AHB clock to SSP1 Periph. */

/** @} */

