coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
/** @defgroup SYSCON_SSP0CLKDIV_Bit_Definitions SSP0CLKDIV: SSP0 Clock Divider Register
  * @{
  */

#define SYSCON_SSP0CLKDIV_Mask         (0xff)              /*!< Usable bits in SSP0CLKDIV reg.   */

/** @} */

/** @defgroup SYSCON_UART0CLKDIV_Bit_Definitions UART0CLKDIV: UART 0 Clock Divider Register
  * @{
  */

#define SYSCON_UART0CLKDIV_Mask        (0xff)              /*!< Usable bits in UART0CLKDIV reg.  */

/** @} */

/** @defgroup SYSCON_SSP1CLKDIV_Bit_Definitions SSP1CLKDIV: SSP1 Clock Divider Register
  * @{
  */

#define SYSCON_SSP1CLKDIV_Mask         (0xff)              /*!< Usable bits in SSP1CLKDIV reg.   */

/** @} */

/** @defgroup SYSCON_WDTCLKSEL_Bit_Definitions WDTCLKSEL: Watchdog Timer Clock Select Register
  * @{
  */

#define SYSCON_WDTCLKSEL_Mask          (0x03)              /*!< WDT Clock Selection Mask         */
#define SYSCON_WDTCLKSEL_IRC           (0x00)              /*!< WDT Clock Fed From Internal RC   */
#define SYSCON_WDTCLKSEL_MAINCLK       (0x01)              /*!< WDT Clock Fed from Main Clock    */
#define SYSCON_WDTCLKSEL_WDTOSC        (0x02)              /*!< WDT Clock Fed from WDT Osc.      */

/** @} */

/** @defgroup SYSCON_WDTCLKUEN_Bit_Definitions WDTCLKUEN: Watchdog Timer Clock Source Update Enable Register
  * @{
  */

#define SYSCON_WDTCLKUEN_ENA           (1 << 0)            /*!< Enable Update of WDT Clock Src.  */

/** @} */

/** @defgroup SYSCON_WDTCLKDIV_Bit_Definitions WDTCLKDIV: Watchdog Timer Clock Divider Register
  * @{
  */

#define SYSCON_WDTCLKDIV_Mask          (0xff)              /*!< Usable bits in WDTCLKDIV reg.    */

/** @} */

/** @defgroup SYSCON_CLKOUTSEL_Bit_Definitions CLKOUTSEL: Clock Out Select Register
  * @{
  */

#define SYSCON_CLKOUTSEL_Mask          (0x03)              /*!< CLKOUT Clock Source Mask         */
#define SYSCON_CLKOUTSEL_IRC           (0x00)              /*!< CLKOUT Clock Fed from Int. RC    */
#define SYSCON_CLKOUTSEL_SYSOSC        (0x01)              /*!< CLKOUT Clock Fed from System Osc.*/
#define SYSCON_CLKOUTSEL_WDTOSC        (0x02)              /*!< CLKOUT Clock Fed from WDT Osc.   */
#define SYSCON_CLKOUTSEL_MAINCLK       (0x03)              /*!< CLKOUT Clock Fed from Main Clock */

/** @} */

/** @defgroup SYSCON_CLKOUTUEN_Bit_Definitions CLKOUTUEN: Clock Out Source Update Enable Register
  * @{
  */

#define SYSCON_CLKOUTUEN_ENA           (1 << 0)            /*!< Enable Update of CLKOUT Source   */

/** @} */

/** @defgroup SYSCON_CLKOUTDIV_Bit_Definitions CLKOUTDIV: Clock Out Divider Register
  * @{
  */

#define SYSCON_CLKOUTDIV_Mask          (0xff)              /*!< Usable bits in CLKOUTDIV         */

/** @} */

/** @defgroup SYSCON_PIOPORCAP0_Bit_Definitions PIOPORCAP0: Programmable IO Power On Reset Capture Register 0
  * @{
  */

#define SYSCON_PIOPORCAP0_CAP_Mask     (0xffffffffUL)      /*!< Power-on Capture 0 bitmask       */
#define SYSCON_PIOPORCAP0_CAP_PIO0_0   (1 << 0)            /*!< Power-on Capt level of PIO0_0    */
#define SYSCON_PIOPORCAP0_CAP_PIO0_1   (1 << 1)            /*!< Power-on Capt level of PIO0_1    */
#define SYSCON_PIOPORCAP0_CAP_PIO0_2   (1 << 2)            /*!< Power-on Capt level of PIO0_2    */
#define SYSCON_PIOPORCAP0_CAP_PIO0_3   (1 << 3)            /*!< Power-on Capt level of PIO0_3    */
#define SYSCON_PIOPORCAP0_CAP_PIO0_4   (1 << 4)            /*!< Power-on Capt level of PIO0_4    */
#define SYSCON_PIOPORCAP0_CAP_PIO0_5   (1 << 5)            /*!< Power-on Capt level of PIO0_5    */
#define SYSCON_PIOPORCAP0_CAP_PIO0_6   (1 << 6)            /*!< Power-on Capt level of PIO0_6    */
#define SYSCON_PIOPORCAP0_CAP_PIO0_7   (1 << 7)            /*!< Power-on Capt level of PIO0_7    */
#define SYSCON_PIOPORCAP0_CAP_PIO0_8   (1 << 8)            /*!< Power-on Capt level of PIO0_8    */
#define SYSCON_PIOPORCAP0_CAP_PIO0_9   (1 << 9)            /*!< Power-on Capt level of PIO0_9    */
#define SYSCON_PIOPORCAP0_CAP_PIO0_10  (1 << 10)           /*!< Power-on Capt level of PIO0_10   */
#define SYSCON_PIOPORCAP0_CAP_PIO0_11  (1 << 11)           /*!< Power-on Capt level of PIO0_11   */
#define SYSCON_PIOPORCAP0_CAP_PIO1_0   (1 << 12)           /*!< Power-on Capt level of PIO1_0    */
#define SYSCON_PIOPORCAP0_CAP_PIO1_1   (1 << 13)           /*!< Power-on Capt level of PIO1_1    */
#define SYSCON_PIOPORCAP0_CAP_PIO1_2   (1 << 14)           /*!< Power-on Capt level of PIO1_2    */
#define SYSCON_PIOPORCAP0_CAP_PIO1_3   (1 << 15)           /*!< Power-on Capt level of PIO1_3    */
#define SYSCON_PIOPORCAP0_CAP_PIO1_4   (1 << 16)           /*!< Power-on Capt level of PIO1_4    */
#define SYSCON_PIOPORCAP0_CAP_PIO1_5   (1 << 17)           /*!< Power-on Capt level of PIO1_5    */
#define SYSCON_PIOPORCAP0_CAP_PIO1_6   (1 << 18)           /*!< Power-on Capt level of PIO1_6    */
#define SYSCON_PIOPORCAP0_CAP_PIO1_7   (1 << 19)           /*!< Power-on Capt level of PIO1_7    */
#define SYSCON_PIOPORCAP0_CAP_PIO1_8   (1 << 20)           /*!< Power-on Capt level of PIO1_8    */
#define SYSCON_PIOPORCAP0_CAP_PIO1_9   (1 << 21)           /*!< Power-on Capt level of PIO1_9    */
#define SYSCON_PIOPORCAP0_CAP_PIO1_10  (1 << 22)           /*!< Power-on Capt level of PIO1_10   */
#define SYSCON_PIOPORCAP0_CAP_PIO1_11  (1 << 23)           /*!< Power-on Capt level of PIO1_11   */
#define SYSCON_PIOPORCAP0_CAP_PIO2_0   (1 << 24)           /*!< Power-on Capt level of PIO2_0    */
#define SYSCON_PIOPORCAP0_CAP_PIO2_1   (1 << 25)           /*!< Power-on Capt level of PIO2_1    */
#define SYSCON_PIOPORCAP0_CAP_PIO2_2   (1 << 26)           /*!< Power-on Capt level of PIO2_2    */
#define SYSCON_PIOPORCAP0_CAP_PIO2_3   (1 << 27)           /*!< Power-on Capt level of PIO2_3    */
#define SYSCON_PIOPORCAP0_CAP_PIO2_4   (1 << 28)           /*!< Power-on Capt level of PIO2_4    */
#define SYSCON_PIOPORCAP0_CAP_PIO2_5   (1 << 29)           /*!< Power-on Capt level of PIO2_5    */
#define SYSCON_PIOPORCAP0_CAP_PIO2_6   (1 << 30)           /*!< Power-on Capt level of PIO2_6    */
#define SYSCON_PIOPORCAP0_CAP_PIO2_7   (1 << 31)           /*!< Power-on Capt level of PIO2_7    */

/** @} */

/** @defgroup SYSCON_PIOPORCAP1_Bit_Definitions PIOPORCAP1: Programmable IO Power On Reset Capture Register 1
  * @{
  */

#define SYSCON_PIOPORCAP1_CAP_Mask     (0x0000003fUL)      /*!< Power-on Capture 1 bitmask       */
#define SYSCON_PIOPORCAP1_CAP_PIO2_8   (1 << 0)            /*!< Power-on Capt level of PIO2_8    */
#define SYSCON_PIOPORCAP1_CAP_PIO2_9   (1 << 1)            /*!< Power-on Capt level of PIO2_9    */
#define SYSCON_PIOPORCAP1_CAP_PIO2_10  (1 << 2)            /*!< Power-on Capt level of PIO2_10   */
#define SYSCON_PIOPORCAP1_CAP_PIO2_11  (1 << 3)            /*!< Power-on Capt level of PIO2_11   */
#define SYSCON_PIOPORCAP1_CAP_PIO3_0   (1 << 4)            /*!< Power-on Capt level of PIO3_0    */
#define SYSCON_PIOPORCAP1_CAP_PIO3_1   (1 << 5)            /*!< Power-on Capt level of PIO3_1    */
#define SYSCON_PIOPORCAP1_CAP_PIO3_2   (1 << 6)            /*!< Power-on Capt level of PIO3_2    */
#define SYSCON_PIOPORCAP1_CAP_PIO3_3   (1 << 7)            /*!< Power-on Capt level of PIO3_3    */
#define SYSCON_PIOPORCAP1_CAP_PIO3_4   (1 << 8)            /*!< Power-on Capt level of PIO3_4    */
#define SYSCON_PIOPORCAP1_CAP_PIO3_5   (1 << 9)            /*!< Power-on Capt level of PIO3_5    */

/** @} */

/** @defgroup SYSCON_BODCTRL_Bit_Definitions BODCTRL: Brown-Out Detector Control Register
  * @{
  */

#define SYSCON_BODCTRL_Mask            (0x1f)              /*!< Usable bits in BODCTRL           */

#define SYSCON_BODCTRL_BODRSTLEV_Mask  (0x03)              /*!< BOD Reset Level Mask             */
#define SYSCON_BODCTRL_BODRSTLEV_Shift (0)                 /*!< Shift of BODCTRL_BODRSTLEV Mask  */
#define SYSCON_BODCTRL_BODRSTLEV_1V46  (0x00)              /*!< BOD Reset @ 1.46V                */
#define SYSCON_BODCTRL_BODRSTLEV_2V06  (0x01)              /*!< BOD Reset @ 2.06V                */
#define SYSCON_BODCTRL_BODRSTLEV_2V35  (0x02)              /*!< BOD Reset @ 2.35V                */
#define SYSCON_BODCTRL_BODRSTLEV_2V71  (0x03)              /*!< BOD Reset @ 2.71V                */

#define SYSCON_BODCTRL_BODINTVAL_Mask  (0x0c)              /*!< BOD Interrupt Level Mask         */
#define SYSCON_BODCTRL_BODINTVAL_Shift (2)                 /*!< Shift of BODCTRL_BODINTVAL Mask  */
#define SYSCON_BODCTRL_BODINTVAL_1V65  (0x00)              /*!< BOD Interrupt @ 1.65V            */
#define SYSCON_BODCTRL_BODINTVAL_2V22  (0x01 << 2)         /*!< BOD Interrupt @ 2.22V            */
#define SYSCON_BODCTRL_BODINTVAL_2V52  (0x02 << 2)         /*!< BOD Interrupt @ 2.52V            */
#define SYSCON_BODCTRL_BODINTVAL_2V80  (0x03 << 2)         /*!< BOD Interrupt @ 2.80V            */

