coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
#define SYSCON_BODCTRL_BODRSTENA       (1 << 4)            /*!< Enable BOD Reset                 */

/** @} */

/** @defgroup SYSCON_SYSTCKCAL_Bit_Definitions SYSTCKCAL: SysTick Calibration Register
  * @{
  */

#define SYSCON_SYSTCKCAL_CAL_Mask      (0x03ffffffUL)      /*!< Systick Calibration Value Mask   */

/** @} */

/** @defgroup SYSCON_STARTAPRP0_Bit_Definitions STARTAPRP0: Start-Logic Edge Control Register 0
  * @{
  */

#define SYSCON_STARTAPRP0_Mask         (0x1fff)            /*!< Start-Logic Edge Control bitmask */
#define SYSCON_STARTAPRP0_APRPIO0_0    (1 << 0)            /*!< Start Logic Edge Ctrl / PIO0_0   */
#define SYSCON_STARTAPRPO_APRPIO0_1    (1 << 1)            /*!< Start Logic Edge Ctrl / PIO0_1   */
#define SYSCON_STARTAPRPO_APRPIO0_2    (1 << 2)            /*!< Start Logic Edge Ctrl / PIO0_2   */
#define SYSCON_STARTAPRPO_APRPIO0_3    (1 << 3)            /*!< Start Logic Edge Ctrl / PIO0_3   */
#define SYSCON_STARTAPRPO_APRPIO0_4    (1 << 4)            /*!< Start Logic Edge Ctrl / PIO0_4   */
#define SYSCON_STARTAPRPO_APRPIO0_5    (1 << 5)            /*!< Start Logic Edge Ctrl / PIO0_5   */
#define SYSCON_STARTAPRPO_APRPIO0_6    (1 << 6)            /*!< Start Logic Edge Ctrl / PIO0_6   */
#define SYSCON_STARTAPRPO_APRPIO0_7    (1 << 7)            /*!< Start Logic Edge Ctrl / PIO0_7   */
#define SYSCON_STARTAPRPO_APRPIO0_8    (1 << 8)            /*!< Start Logic Edge Ctrl / PIO0_8   */
#define SYSCON_STARTAPRPO_APRPIO0_9    (1 << 9)            /*!< Start Logic Edge Ctrl / PIO0_9   */
#define SYSCON_STARTAPRPO_APRPIO0_10   (1 << 10)           /*!< Start Logic Edge Ctrl / PIO0_10  */
#define SYSCON_STARTAPRPO_APRPIO0_11   (1 << 11)           /*!< Start Logic Edge Ctrl / PIO0_11  */
#define SYSCON_STARTAPRPO_APRPIO1_0    (1 << 12)           /*!< Start Logic Edge Ctrl / PIO1_0   */

/** @} */

/** @defgroup SYSCON_STARTERP0_Bit_Definitions STARTERP0: Start-Logic Enable Control Register 0
  * @{
  */

#define SYSCON_STARTEPRP0_Mask         (0x1fff)            /*!< Start-Logic Enable bitmask       */
#define SYSCON_STARTERP0_ERPIO0_0      (1 << 0)            /*!< Start Logic Enable for PIO0_0    */
#define SYSCON_STARTERP0_ERPIO0_1      (1 << 1)            /*!< Start Logic Enable for PIO0_1    */
#define SYSCON_STARTERP0_ERPIO0_2      (1 << 2)            /*!< Start Logic Enable for PIO0_2    */
#define SYSCON_STARTERP0_ERPIO0_3      (1 << 3)            /*!< Start Logic Enable for PIO0_3    */
#define SYSCON_STARTERP0_ERPIO0_4      (1 << 4)            /*!< Start Logic Enable for PIO0_4    */
#define SYSCON_STARTERP0_ERPIO0_5      (1 << 5)            /*!< Start Logic Enable for PIO0_5    */
#define SYSCON_STARTERP0_ERPIO0_6      (1 << 6)            /*!< Start Logic Enable for PIO0_6    */
#define SYSCON_STARTERP0_ERPIO0_7      (1 << 7)            /*!< Start Logic Enable for PIO0_7    */
#define SYSCON_STARTERP0_ERPIO0_8      (1 << 8)            /*!< Start Logic Enable for PIO0_8    */
#define SYSCON_STARTERP0_ERPIO0_9      (1 << 9)            /*!< Start Logic Enable for PIO0_9    */
#define SYSCON_STARTERP0_ERPIO0_10     (1 << 10)           /*!< Start Logic Enable for PIO0_10   */
#define SYSCON_STARTERP0_ERPIO0_11     (1 << 11)           /*!< Start Logic Enable for PIO0_11   */
#define SYSCON_STARTERP0_ERPIO1_0      (1 << 12)           /*!< Start Logic Enable for PIO1_0    */

/** @} */

/** @defgroup SYSCON_STARTRSRP0CLR_Bit_Definitions STARTRSRP0CLR: Start-Logic Clear Control Register 0
  * @{
  */

#define SYSCON_STARTRSRP0CLR_Mask       (0x1fff)           /*!< Start-Logic Clear bitmask        */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_0  (1 << 0)           /*!< Start Logic Clear for PIO0_0     */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_1  (1 << 1)           /*!< Start Logic Clear for PIO0_1     */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_2  (1 << 2)           /*!< Start Logic Clear for PIO0_2     */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_3  (1 << 3)           /*!< Start Logic Clear for PIO0_3     */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_4  (1 << 4)           /*!< Start Logic Clear for PIO0_4     */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_5  (1 << 5)           /*!< Start Logic Clear for PIO0_5     */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_6  (1 << 6)           /*!< Start Logic Clear for PIO0_6     */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_7  (1 << 7)           /*!< Start Logic Clear for PIO0_7     */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_8  (1 << 8)           /*!< Start Logic Clear for PIO0_8     */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_9  (1 << 9)           /*!< Start Logic Clear for PIO0_9     */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_10 (1 << 10)          /*!< Start Logic Clear for PIO0_10    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_11 (1 << 11)          /*!< Start Logic Clear for PIO0_11    */
#define SYSCON_STARTRSRP0CLR_RSRPIO1_0  (1 << 12)          /*!< Start Logic Clear for PIO1_0     */

/** @} */

/** @defgroup SYSCON_STARTSRP0_Bit_Definitions STARTSRP0: Start-Logic Status Register 0
  * @{
  */

#define SYSCON_STARTSRP0_Mask          (0x1fff)            /*!< Start-Logic Status bitmask      */
#define SYSCON_STARTSRP0_SRPIO0_0      (1 << 0)            /*!< Start Logic Status for PIO0_0    */
#define SYSCON_STARTSRP0_SRPIO0_1      (1 << 1)            /*!< Start Logic Status for PIO0_1    */
#define SYSCON_STARTSRP0_SRPIO0_2      (1 << 2)            /*!< Start Logic Status for PIO0_2    */
#define SYSCON_STARTSRP0_SRPIO0_3      (1 << 3)            /*!< Start Logic Status for PIO0_3    */
#define SYSCON_STARTSRP0_SRPIO0_4      (1 << 4)            /*!< Start Logic Status for PIO0_4    */
#define SYSCON_STARTSRP0_SRPIO0_5      (1 << 5)            /*!< Start Logic Status for PIO0_5    */
#define SYSCON_STARTSRP0_SRPIO0_6      (1 << 6)            /*!< Start Logic Status for PIO0_6    */
#define SYSCON_STARTSRP0_SRPIO0_7      (1 << 7)            /*!< Start Logic Status for PIO0_7    */
#define SYSCON_STARTSRP0_SRPIO0_8      (1 << 8)            /*!< Start Logic Status for PIO0_8    */
#define SYSCON_STARTSRP0_SRPIO0_9      (1 << 9)            /*!< Start Logic Status for PIO0_9    */
#define SYSCON_STARTSRP0_SRPIO0_10     (1 << 10)           /*!< Start Logic Status for PIO0_10   */
#define SYSCON_STARTSRP0_SRPIO0_11     (1 << 11)           /*!< Start Logic Status for PIO0_11   */
#define SYSCON_STARTSRP0_SRPIO1_0      (1 << 12)           /*!< Start Logic Status for PIO0_12   */

/** @} */

/** @defgroup SYSCON_PDSLEEPCFG_Bit_Definitions PDSLEEPCFG: Power-Down Sleep Configuration Register
  * @{
  */

#define SYSCON_PDSLEEPCFG_Mask         (0x48)              /*!< Sleep Mode PowerDown Config Mask */
#define SYSCON_PDSLEEPCFG_Required     (0x000018b7UL)      /*!< Required Bits for PDSLEEPCFG     */
#define SYSCON_PDSLEEPCFG_BOD_PD       (1 << 3)            /*!< Power Down BOD on Sleep          */
#define SYSCON_PDSLEEPCFG_WDTOSC_PD    (1 << 6)            /*!< Power Down WDT Osc. on Sleep     */

/* Other bits must be left alone */

/** @} */

/** @defgroup SYSCON_PDAWAKECFG_Bit_Definitions PDAWAKECFG: Power-Down Awake Configuration Register
  * @{
  */

#define SYSCON_PDAWAKECFG_Mask         (0xff)              /*!< Awake Mode PowerDown Config Mask */
#define SYSCON_PDAWAKECFG_Required     (0x00000ed00UL)     /*!< Required Bits for PDAWAKECFG     */
#define SYSCON_PDAWAKECFG_IRCOUT_PD    (1 << 0)            /*!< Power Down IRC Out in Wake Mode  */
#define SYSCON_PDAWAKECFG_IRC_PD       (1 << 1)            /*!< Power Down IRC Clk in Wake Mode  */
#define SYSCON_PDAWAKECFG_FLASH_PD     (1 << 2)            /*!< Power Down Flash in Wake Mode    */
#define SYSCON_PDAWAKECFG_BOD_PD       (1 << 3)            /*!< Power Down BOD in Wake Mode      */
#define SYSCON_PDAWAKECFG_ADC0_PD      (1 << 4)            /*!< Power Down AtoD 0 in Wake Mode   */
#define SYSCON_PDAWAKECFG_SYSOSC_PD    (1 << 5)            /*!< Power Down Sys Osc. in Wake Mode */
#define SYSCON_PDAWAKECFG_WDTOSC_PD    (1 << 6)            /*!< Power Down WDT Osc. in Wake Mode */
#define SYSCON_PDAWAKECFG_SYSPLL_PD    (1 << 7)            /*!< Power Down Sys PLL in Wake Mode  */

/** @} */

/** @defgroup SYSCON_PDRUNCFG_Bit_Definitions PDRUNCFG: Power-Down Running Configuration Register
  * @{
  */

#define SYSCON_PDRUNCFG_Mask           (0xff)              /*!< Run Mode Power-Down Config Mask  */
#define SYSCON_PDRUNCFG_Required       (0x00000ed00UL)     /*!< Required Bits for PDRUNCFG       */
#define SYSCON_IRCOUT_PD               (1 << 0)            /*!< Power down IRC Out in Run Mode   */
#define SYSCON_IRC_PD                  (1 << 1)            /*!< Power down IRC clock in Run Mode */
#define SYSCON_FLASH_PD                (1 << 2)            /*!< Power down FLASH in Run Mode     */
#define SYSCON_BOD_PD                  (1 << 3)            /*!< Power down BOD in Run Mode       */
#define SYSCON_PDRUNCFG_ADC0_PD        (1 << 4)            /*!< Power down AtoD 0 in Run Mode    */
#define SYSCON_PDRUNCFG_SYSOSC_PD      (1 << 5)            /*!< Power down Sys Osc in Run Mode   */
#define SYSCON_PDRUNCFG_WDTOSC_PD      (1 << 6)            /*!< Power down WDT Osc in Run Mode   */
#define SYSCON_PDRUNCFG_PLL_PD         (1 << 7)            /*!< Power down Sys PLL in Run Mode   */

/** @} */

/**
  * @}
  */


