coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
/** @defgroup CT16B_Register_Bit_Definitions CT16B Register Bit Definitions
  * @ingroup  CT16B
  * @{
  */

/** @defgroup CT16B_IR_Bit_Definitions IR: Interrupt Register
  * @{
  */

#define CT16B_IR_Mask                  (0x1f)              /*!< Usable bits in IR                */

#define CT16B_IR_MR0                   (1 << 0)            /*!< Match Channel 0 Interrupt Flag   */
#define CT16B_IR_MR1                   (1 << 1)            /*!< Match Channel 1 Interrupt Flag   */
#define CT16B_IR_MR2                   (1 << 2)            /*!< Match Channel 2 Interrupt Flag   */
#define CT16B_IR_MR3                   (1 << 3)            /*!< Match Channel 3 Interrupt Flag   */
#define CT16B_IR_CR0                   (1 << 4)            /*!< Capture Channel 0 Interrupt Flag */

/** @} */

/** @defgroup CT16B_TCR_Bit_Definitions TCR: Control Register
  * @{
  */

#define CT16B_TCR_Mask                 (0x03)              /*!< Usable bits in TCR               */

#define CT16B_CE                       (1 << 0)            /*!< Counter Enable                   */
#define CT16B_CR                       (1 << 1)            /*!< Counter Reset                    */

/** @} */

/** @defgroup CT16B_TC_Bit_Definitions TC: Timer Counter Register
  * @{
  */

#define CT16B_TC_Mask                  (0xffff)            /*!< Mask for Timer Counter Count     */

/** @} */

/** @defgroup CT16B_PR_Bit_Definitions PR: Prescale Register
  * @{
  */

#define CT16B_PR_Mask                  (0xffff)            /*!< Mask for Prescale Register Value */

/** @} */

/** @defgroup CT16B_PC_Bit_Definitions PC: Prescale Counter Register
  * @{
  */

#define CT16B_PC_Mask                  (0xffff)            /*!< Mask for Prescale Counter Value  */

/** @} */

/** @defgroup CT16B_MCR_Bit_Definitions MCR: Match Control Register
  * @{
  */

#define CT16B_MCR_Mask                 (0x0fff)            /*!< Usable bits in MCRn              */

#define CT16B_MR0I                     (1 << 0)            /*!< Interrupt when MR0 matches TC    */
#define CT16B_MR0R                     (1 << 1)            /*!< Reset if MR0 matches TC          */
#define CT16B_MR0S                     (1 << 2)            /*!< Stop if MR0 matches TC           */
#define CT16B_MR1I                     (1 << 3)            /*!< Interrupt when MR1 matches TC    */
#define CT16B_MR1R                     (1 << 4)            /*!< Reset if MR1 matches TC          */
#define CT16B_MR1S                     (1 << 5)            /*!< Stop if MR1 matches TC           */
#define CT16B_MR2I                     (1 << 6)            /*!< Interrupt when MR2 matches TC    */
#define CT16B_MR2R                     (1 << 7)            /*!< Reset if MR2 matches TC          */
#define CT16B_MR2S                     (1 << 8)            /*!< Stop if MR2 matches TC           */
#define CT16B_MR3I                     (1 << 9)            /*!< Interrupt when MR3 matches TC    */
#define CT16B_MR3R                     (1 << 10)           /*!< Reset if MR3 matches TC          */
#define CT16B_MR3S                     (1 << 11)           /*!< Stop if MR3 matches TC           */

/** @} */

/** @defgroup CT16B_CCR_Bit_Definitions CCR: Capture Control Register
  * @{
  */

#define CT16B_CCR_Mask                 (0x07)              /*!< Usable bits in CCR              */

#define CT16B_CAP0RE                   (1 << 0)            /*!< Capture on CAP0 rising edge     */
#define CT16B_CAP0FE                   (1 << 1)            /*!< Capture on CAP0 falling edge    */
#define CT16B_CAP0I                    (1 << 2)            /*!< Enable Interrupt on Capt Event  */

/** @} */

/** @defgroup CT16B_CR0_Bit_Definitions CR0: Capture Register 0
  * @{
  */

#define CT16B_CR0_Mask                 (0xffff)            /*!< Mask for Capture Value           */

/** @} */

/** @defgroup CT16B_EMR_Bit_Definitions EMR: External Match Register
  * @{
  */

#define CT16B_EMR_Mask                 (0x0fff)            /*!< Usable bits in EMR               */

#define CT16B_EM0                      (1 << 0)            /*!< Status of MAT0 Pin               */
#define CT16B_EM1                      (1 << 1)            /*!< Status of MAT1 Pin               */
#define CT16B_EM2                      (1 << 2)            /*!< Status of MAT2 Pin               */
#define CT16B_EM3                      (1 << 3)            /*!< Status of MAT3 Pin               */

#define CT16B_EMC0_Mask                (0x03 << 4)         /*!< MAT0 Match Control Bits          */
#define CT16B_EMC0_Shift               (4)                 /*!< Bit shift of EMC0 Mask           */

#define CT16B_EMC1_Mask                (0x03 << 6)         /*!< MAT1 Match Control Bits          */
#define CT16B_EMC1_Shift               (6)                 /*!< Bit shift of EMC1 Mask           */

#define CT16B_EMC2_Mask                (0x03 << 8)         /*!< MAT2 Match Control Bits          */
#define CT16B_EMC2_Shift               (8)                 /*!< Bit shift of EMC2 Mask           */

#define CT16B_EMC3_Mask                (0x03 << 10)        /*!< MAT3 Match Control Bits          */
#define CT16B_EMC3_Shift               (10)                /*!< Bit shift of EMC3 Mask           */

/** @} */

/** @defgroup CT16B_CTCR_Bit_Definitions CTCR: Timer Count Control Registe
  * @{
  */

#define CT16B_CTCR_Mask                (0x0f)              /*!< Usable bits in CTCR              */

#define CT16B_MODE_Mask                (0x03)              /*!< Count/Timer Mode Mask            */
#define CT16B_MODE_Shift               (0)                 /*!< Bit shift of MODE Mask           */
#define CT16B_MODE_TIMER               (0x00)              /*!< Timer Mode                       */
#define CT16B_MODE_COUNT_RISE          (0x01)              /*!< Count Rising Edges               */
#define CT16B_MODE_COUNT_FALL          (0x02)              /*!< Count Falling Edges              */
#define CT16B_MODE_COUNT_BOTH          (0x03)              /*!< Count Both Edges                 */

#define CT16B_COUNT_INPUT_Mask         (0x03 << 2)         /*!< Counter Mode Input Channel       */
#define CT16B_COUNT_INPUT_Shift        (2)                 /*!< Bit shift of COUNT_INPUT Mask    */
#define CT16B_COUNT_INPUT_CAP0         (0x00)              /*!< Counter Input CAP0 Pin           */

/** @} */

/** @defgroup CT16B_PWMC_Bit_Definitions PWMC: PWM Control Register
  * @{
  */

