coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
/** @defgroup GPIO_Register_Bit_Definitions GPIO Register Bit Definitions
  * @ingroup  GPIO
  * @{
  */

/** @defgroup GPIO_DATA_Bit_Definitions DATAn: Data Registers
  * @{
  */

#define GPIO_DATA_Mask                 (0x0fff)            /*!< Bitmask of all GPIO data bits    */
#define GPIO_D0                        (1 << 0)            /*!< Pin 0  Data                      */
#define GPIO_D1                        (1 << 1)            /*!< Pin 1  Data                      */
#define GPIO_D2                        (1 << 2)            /*!< Pin 2  Data                      */
#define GPIO_D3                        (1 << 3)            /*!< Pin 3  Data                      */
#define GPIO_D4                        (1 << 4)            /*!< Pin 4  Data                      */
#define GPIO_D5                        (1 << 5)            /*!< Pin 5  Data                      */
#define GPIO_D6                        (1 << 6)            /*!< Pin 6  Data                      */
#define GPIO_D7                        (1 << 7)            /*!< Pin 7  Data                      */
#define GPIO_D8                        (1 << 8)            /*!< Pin 8  Data                      */
#define GPIO_D9                        (1 << 9)            /*!< Pin 9  Data                      */
#define GPIO_D10                       (1 << 10)           /*!< Pin 10 Data                      */
#define GPIO_D11                       (1 << 11)           /*!< Pin 11 Data                      */

/** @} */

/** @defgroup GPIO_DIR_Bit_Definitions DIR: Direction Register
  * @{
  */

#define GPIO_DIR_Mask                  (0x0fff)            /*!< Bitmask of all GPIO dir bits     */
#define GPIO_DIR0                      (1 << 0)            /*!< Pin 0  Direction (0=IN / 1=OUT)  */
#define GPIO_DIR1                      (1 << 1)            /*!< Pin 1  Direction (0=IN / 1=OUT)  */
#define GPIO_DIR2                      (1 << 2)            /*!< Pin 2  Direction (0=IN / 1=OUT)  */
#define GPIO_DIR3                      (1 << 3)            /*!< Pin 3  Direction (0=IN / 1=OUT)  */
#define GPIO_DIR4                      (1 << 4)            /*!< Pin 4  Direction (0=IN / 1=OUT)  */
#define GPIO_DIR5                      (1 << 5)            /*!< Pin 5  Direction (0=IN / 1=OUT)  */
#define GPIO_DIR6                      (1 << 6)            /*!< Pin 6  Direction (0=IN / 1=OUT)  */
#define GPIO_DIR7                      (1 << 7)            /*!< Pin 7  Direction (0=IN / 1=OUT)  */
#define GPIO_DIR8                      (1 << 8)            /*!< Pin 8  Direction (0=IN / 1=OUT)  */
#define GPIO_DIR9                      (1 << 9)            /*!< Pin 9  Direction (0=IN / 1=OUT)  */
#define GPIO_DIR10                     (1 << 10)           /*!< Pin 10 Direction (0=IN / 1=OUT)  */
#define GPIO_DIR11                     (1 << 11)           /*!< Pin 11 Direction (0=IN / 1=OUT)  */

/** @} */

/** @defgroup GPIO_ISENSE_Bit_Definitions ISENSE: Interrupt Sense Control Register
  * @{
  */

#define GPIO_IS_Mask                   (0x0fff)            /*!< Bitmask of all GPIO int senses   */
#define GPIO_IS0                       (1 << 0)            /*!< Pin 0  Int Sense (0=Edge/1=Lvl)  */
#define GPIO_IS1                       (1 << 1)            /*!< Pin 1  Int Sense (0=Edge/1=Lvl)  */
#define GPIO_IS2                       (1 << 2)            /*!< Pin 2  Int Sense (0=Edge/1=Lvl)  */
#define GPIO_IS3                       (1 << 3)            /*!< Pin 3  Int Sense (0=Edge/1=Lvl)  */
#define GPIO_IS4                       (1 << 4)            /*!< Pin 4  Int Sense (0=Edge/1=Lvl)  */
#define GPIO_IS5                       (1 << 5)            /*!< Pin 5  Int Sense (0=Edge/1=Lvl)  */
#define GPIO_IS6                       (1 << 6)            /*!< Pin 6  Int Sense (0=Edge/1=Lvl)  */
#define GPIO_IS7                       (1 << 7)            /*!< Pin 7  Int Sense (0=Edge/1=Lvl)  */
#define GPIO_IS8                       (1 << 8)            /*!< Pin 8  Int Sense (0=Edge/1=Lvl)  */
#define GPIO_IS9                       (1 << 9)            /*!< Pin 9  Int Sense (0=Edge/1=Lvl)  */
#define GPIO_IS10                      (1 << 10)           /*!< Pin 10 Int Sense (0=Edge/1=Lvl)  */
#define GPIO_IS11                      (1 << 11)           /*!< Pin 11 Int Sense (0=Edge/1=Lvl)  */

/** @} */

/** @defgroup GPIO_IBE_Bit_Definitions IBE: Interrupt Both Edges Register
  * @{
  */

#define GPIO_IBE_Mask                  (0x0fff)            /*!< Bitmask of all "both edges" ints */
#define GPIO_IBE0                      (1 << 0)            /*!< Pin 0  Int Both Edges (1 = Both) */
#define GPIO_IBE1                      (1 << 1)            /*!< Pin 1  Int Both Edges (1 = Both) */
#define GPIO_IBE2                      (1 << 2)            /*!< Pin 2  Int Both Edges (1 = Both) */
#define GPIO_IBE3                      (1 << 3)            /*!< Pin 3  Int Both Edges (1 = Both) */
#define GPIO_IBE4                      (1 << 4)            /*!< Pin 4  Int Both Edges (1 = Both) */
#define GPIO_IBE5                      (1 << 5)            /*!< Pin 5  Int Both Edges (1 = Both) */
#define GPIO_IBE6                      (1 << 6)            /*!< Pin 6  Int Both Edges (1 = Both) */
#define GPIO_IBE7                      (1 << 7)            /*!< Pin 7  Int Both Edges (1 = Both) */
#define GPIO_IBE8                      (1 << 8)            /*!< Pin 8  Int Both Edges (1 = Both) */
#define GPIO_IBE9                      (1 << 9)            /*!< Pin 9  Int Both Edges (1 = Both) */
#define GPIO_IBE10                     (1 << 10)           /*!< Pin 10 Int Both Edges (1 = Both) */
#define GPIO_IBE11                     (1 << 11)           /*!< Pin 11 Int Both Edges (1 = Both) */

/** @} */

/** @defgroup GPIO_IEV_Bit_Definitions IEV: Interrupt Event Level Register
  * @{
  */

#define GPIO_IEV_Mask                  (0x0fff)            /*!< Bitmask of all GPIO event levels */
#define GPIO_IEV0                      (1 << 0)            /*!< Pin 0  Int Event Level (0=L,1=H) */
#define GPIO_IEV1                      (1 << 1)            /*!< Pin 1  Int Event Level (0=L,1=H) */
#define GPIO_IEV2                      (1 << 2)            /*!< Pin 2  Int Event Level (0=L,1=H) */
#define GPIO_IEV3                      (1 << 3)            /*!< Pin 3  Int Event Level (0=L,1=H) */
#define GPIO_IEV4                      (1 << 4)            /*!< Pin 4  Int Event Level (0=L,1=H) */
#define GPIO_IEV5                      (1 << 5)            /*!< Pin 5  Int Event Level (0=L,1=H) */
#define GPIO_IEV6                      (1 << 6)            /*!< Pin 6  Int Event Level (0=L,1=H) */
#define GPIO_IEV7                      (1 << 7)            /*!< Pin 7  Int Event Level (0=L,1=H) */
#define GPIO_IEV8                      (1 << 8)            /*!< Pin 8  Int Event Level (0=L,1=H) */
#define GPIO_IEV9                      (1 << 9)            /*!< Pin 9  Int Event Level (0=L,1=H) */
#define GPIO_IEV10                     (1 << 10)           /*!< Pin 10 Int Event Level (0=L,1=H) */
#define GPIO_IEV11                     (1 << 11)           /*!< Pin 11 Int Event Level (0=L,1=H) */

/** @} */

