coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
/** @defgroup GPIO_IE_and_MIS_Bit_Definitions (IE, MIS): Interrupt Enable, Interrupt Mask Registers
  * @{
  */

#define GPIO_MASK_Mask                 (0x0fff)            /*!< Bitmask of all GPIO interrupts   */
#define GPIO_MASK0                     (1 << 0)            /*!< Pin 0  Interrupt Mask(ed)        */
#define GPIO_MASK1                     (1 << 1)            /*!< Pin 1  Interrupt Mask(ed)        */
#define GPIO_MASK2                     (1 << 2)            /*!< Pin 2  Interrupt Mask(ed)        */
#define GPIO_MASK3                     (1 << 3)            /*!< Pin 3  Interrupt Mask(ed)        */
#define GPIO_MASK4                     (1 << 4)            /*!< Pin 4  Interrupt Mask(ed)        */
#define GPIO_MASK5                     (1 << 5)            /*!< Pin 5  Interrupt Mask(ed)        */
#define GPIO_MASK6                     (1 << 6)            /*!< Pin 6  Interrupt Mask(ed)        */
#define GPIO_MASK7                     (1 << 7)            /*!< Pin 7  Interrupt Mask(ed)        */
#define GPIO_MASK8                     (1 << 8)            /*!< Pin 8  Interrupt Mask(ed)        */
#define GPIO_MASK9                     (1 << 9)            /*!< Pin 9  Interrupt Mask(ed)        */
#define GPIO_MASK10                    (1 << 10)           /*!< Pin 10 Interrupt Mask(ed)        */
#define GPIO_MASK11                    (1 << 11)           /*!< Pin 11 Interrupt Mask(ed)        */

/** @} */

/** @defgroup GPIO_IRS_Bit_Definitions IRS: Interrupt Raw Status Register
  * @{
  */

#define GPIO_IRS_Mask                  (0x0fff)            /*!< Bitmask of all GPIO raw ints     */
#define GPIO_RAWST0                    (1 << 0)            /*!< Pin 0  Raw Int Status            */
#define GPIO_RAWST1                    (1 << 1)            /*!< Pin 1  Raw Int Status            */
#define GPIO_RAWST2                    (1 << 2)            /*!< Pin 2  Raw Int Status            */
#define GPIO_RAWST3                    (1 << 3)            /*!< Pin 3  Raw Int Status            */
#define GPIO_RAWST4                    (1 << 4)            /*!< Pin 4  Raw Int Status            */
#define GPIO_RAWST5                    (1 << 5)            /*!< Pin 5  Raw Int Status            */
#define GPIO_RAWST6                    (1 << 6)            /*!< Pin 6  Raw Int Status            */
#define GPIO_RAWST7                    (1 << 7)            /*!< Pin 7  Raw Int Status            */
#define GPIO_RAWST8                    (1 << 8)            /*!< Pin 8  Raw Int Status            */
#define GPIO_RAWST9                    (1 << 9)            /*!< Pin 9  Raw Int Status            */
#define GPIO_RAWST10                   (1 << 10)           /*!< Pin 10 Raw Int Status            */
#define GPIO_RAWST11                   (1 << 11)           /*!< Pin 11 Raw Int Status            */

/** @} */

/** @defgroup GPIO_IC_Bit_Definitions IC: Interrupt Clear Register
  * @{
  */

#define GPIO_CLR_Mask                  (0x0fff)            /*!< Bitmask of all GPIO int clears   */
#define GPIO_CLR0                      (1 << 0)            /*!< Pin 0  Clear Interrupt           */
#define GPIO_CLR1                      (1 << 1)            /*!< Pin 1  Clear Interrupt           */
#define GPIO_CLR2                      (1 << 2)            /*!< Pin 2  Clear Interrupt           */
#define GPIO_CLR3                      (1 << 3)            /*!< Pin 3  Clear Interrupt           */
#define GPIO_CLR4                      (1 << 4)            /*!< Pin 4  Clear Interrupt           */
#define GPIO_CLR5                      (1 << 5)            /*!< Pin 5  Clear Interrupt           */
#define GPIO_CLR6                      (1 << 6)            /*!< Pin 6  Clear Interrupt           */
#define GPIO_CLR7                      (1 << 7)            /*!< Pin 7  Clear Interrupt           */
#define GPIO_CLR8                      (1 << 8)            /*!< Pin 8  Clear Interrupt           */
#define GPIO_CLR9                      (1 << 9)            /*!< Pin 9  Clear Interrupt           */
#define GPIO_CLR10                     (1 << 10)           /*!< Pin 10 Clear Interrupt           */
#define GPIO_CLR11                     (1 << 11)           /*!< Pin 11 Clear Interrupt           */

/** @} */

/**
  * @}
  */


#if defined(LPC11CXX)

/** @defgroup CAN_Register_Bit_Definitions CAN Register Bit Definitions
  * @ingroup  CAN
  * @{
  */

/** @defgroup CAN_CNTL_Bit_Definitions CNTL: CAN Control Register
  * @{
  */

#define CAN_CNTL_Mask                  (0x00ef)            /*!< Usable bits in CNTL register     */

#define CAN_INIT                       (1 << 0)            /*!< Initialization is Started        */
#define CAN_IE                         (1 << 1)            /*!< CAN Module Interrupt Enable      */
#define CAN_SIE                        (1 << 2)            /*!< Status Change Interrupt Enable   */
#define CAN_EIE                        (1 << 3)            /*!< Error Interrupt Enable           */
#define CAN_DAR                        (1 << 5)            /*!< Disable Auto-Retransmit          */
#define CAN_CCE                        (1 << 6)            /*!< Configuration Change Enable      */
#define CAN_TEST                       (1 << 7)            /*!< TEST Mode Enable                 */

/** @} */

/** @defgroup CAN_STAT_Bit_Definitions STAT: CAN Status Register
  * @{
  */

#define CAN_STAT_Mask                  (0x00ff)            /*!< Usable bits in STATUS register   */

#define CAN_LEC_Mask                   (0x0007)            /*!< "Last Error Code" bitmask        */
#define CAN_LEC_Shift                  (0)                 /*!< Bit shift of LEC mask            */

#define CAN_LEC_NO_ERROR               (0x00)              /*!< No Error.                        */
#define CAN_LEC_STUFF_ERROR            (0x01)              /*!< Bit Stuff Error                  */
#define CAN_LEC_FORM_ERROR             (0x02)              /*!< Bad Message Format               */
#define CAN_LEC_ACK_ERROR              (0x03)              /*!< Message was not Ack'd            */
#define CAN_LEC_BIT1_ERROR             (0x04)              /*!< Tx'd recessive 1 bit forced low  */
#define CAN_LEC_BIT0_ERROR             (0x05)              /*!< Tx'd dominant 0 bit forced high  */
#define CAN_LEC_CRC_ERROR              (0x06)              /*!< Bad CRC Checksum                 */

