coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
#define CAN_TXOK                       (1 << 3)            /*!< Tx was Successful (reset by cpu) */
#define CAN_RXOK                       (1 << 4)            /*!< Rx'd Successfully (reset by cpu) */
#define CAN_EPASS                      (1 << 5)            /*!< Error Passive State         (RO) */
#define CAN_EWARN                      (1 << 6)            /*!< At least 1 err ctr >= 96    (RO) */
#define CAN_BOFF                       (1 << 7)            /*!< Ctrlr is in BUSOFF state    (RO) */

/** @} */

/** @defgroup CAN_EC_Bit_Definitions EC: CAN Error Counter Register (RO)
  * @{
  */

#define CAN_EC_Mask                    (0xffff)            /*!< Usable bits in EC register       */

#define CAN_TEC_Mask                   (0x00ff)            /*!< Transmit Error Count bitmask     */
#define CAN_TEC_Shift                  (0)                 /*!< Bit shift of TEC mask            */

#define CAN_REC_Mask                   (0x007f << 8)       /*!< Receive Error Count bitmask      */
#define CAN_REC_Shift                  (8)                 /*!< Bit shift of REC mask            */

#define CAN_RP                         (1 << 15)           /*!< Receive Error Passive            */

/** @} */

/** @defgroup CAN_BT_Bit_Definitions BT: CAN Bit Timing Register
  * @{
  */

#define CAN_BT_Mask                    (0x7fff)            /*!< Useable bits in BT register      */

#define CAN_BRP_Mask                   (0x002f)            /*!< Baud Rate Prescaler Bitmask      */
#define CAN_BRP_Shift                  (0)                 /*!< Bit shift of BRP mask            */

#define CAN_SJW_Mask                   (0x0003 << 6)       /*!< Resync Jump Width Bitmask        */
#define CAN_SJW_Shift                  (6)                 /*!< Bit shift of SJW mask            */

#define CAN_TSEG1_Mask                 (0x000f << 8)       /*!< Time Segmt Before Sample Point   */
#define CAN_TSEG1_Shift                (8)                 /*!< Bit shift of TSEG1 mask          */

#define CAN_TSEG2_Mask                 (0x0007 << 12)      /*!< Time Segmt After Sample Point    */
#define CAN_TSEG2_Shift                (12)                 /*!< Bit shift of TSEG2 mask         */

/** @} */

/** @defgroup CAN_INT_Bit_Definitions INT: CAN Interrupt Register (RO)
  * @{
  */

#define CAN_INTID_Mask                 (0xffff)            /*!< CAN Interrupt ID Bitmask         */
#define CAN_INTID_NONE                 (0x0000)            /*!< No Interrupt Pending             */
#define CAN_INTID_MESSAGE_1            (0x0001)            /*!< Interrupt from Message Object 1  */
#define CAN_INTID_MESSAGE_2            (0x0002)            /*!< Interrupt from Message Object 2  */
#define CAN_INTID_MESSAGE_3            (0x0003)            /*!< Interrupt from Message Object 3  */
#define CAN_INTID_MESSAGE_4            (0x0004)            /*!< Interrupt from Message Object 4  */
#define CAN_INTID_MESSAGE_5            (0x0005)            /*!< Interrupt from Message Object 5  */
#define CAN_INTID_MESSAGE_6            (0x0006)            /*!< Interrupt from Message Object 6  */
#define CAN_INTID_MESSAGE_7            (0x0007)            /*!< Interrupt from Message Object 7  */
#define CAN_INTID_MESSAGE_8            (0x0008)            /*!< Interrupt from Message Object 8  */
#define CAN_INTID_MESSAGE_9            (0x0009)            /*!< Interrupt from Message Object 9  */
#define CAN_INTID_MESSAGE_10           (0x000a)            /*!< Interrupt from Message Object 10 */
#define CAN_INTID_MESSAGE_11           (0x000b)            /*!< Interrupt from Message Object 11 */
#define CAN_INTID_MESSAGE_12           (0x000c)            /*!< Interrupt from Message Object 12 */
#define CAN_INTID_MESSAGE_13           (0x000d)            /*!< Interrupt from Message Object 13 */
#define CAN_INTID_MESSAGE_14           (0x000e)            /*!< Interrupt from Message Object 14 */
#define CAN_INTID_MESSAGE_15           (0x000f)            /*!< Interrupt from Message Object 15 */
#define CAN_INTID_MESSAGE_16           (0x0010)            /*!< Interrupt from Message Object 16 */
#define CAN_INTID_MESSAGE_17           (0x0011)            /*!< Interrupt from Message Object 17 */
#define CAN_INTID_MESSAGE_18           (0x0012)            /*!< Interrupt from Message Object 18 */
#define CAN_INTID_MESSAGE_19           (0x0013)            /*!< Interrupt from Message Object 19 */
#define CAN_INTID_MESSAGE_20           (0x0014)            /*!< Interrupt from Message Object 20 */
#define CAN_INTID_MESSAGE_21           (0x0015)            /*!< Interrupt from Message Object 21 */
#define CAN_INTID_MESSAGE_22           (0x0016)            /*!< Interrupt from Message Object 22 */
#define CAN_INTID_MESSAGE_23           (0x0017)            /*!< Interrupt from Message Object 23 */
#define CAN_INTID_MESSAGE_24           (0x0018)            /*!< Interrupt from Message Object 24 */
#define CAN_INTID_MESSAGE_25           (0x0019)            /*!< Interrupt from Message Object 25 */
#define CAN_INTID_MESSAGE_26           (0x001a)            /*!< Interrupt from Message Object 26 */
#define CAN_INTID_MESSAGE_27           (0x001b)            /*!< Interrupt from Message Object 27 */
#define CAN_INTID_MESSAGE_28           (0x001c)            /*!< Interrupt from Message Object 28 */
#define CAN_INTID_MESSAGE_29           (0x001d)            /*!< Interrupt from Message Object 29 */
#define CAN_INTID_MESSAGE_30           (0x001e)            /*!< Interrupt from Message Object 30 */
#define CAN_INTID_MESSAGE_31           (0x001f)            /*!< Interrupt from Message Object 31 */
#define CAN_INTID_MESSAGE_32           (0x0020)            /*!< Interrupt from Message Object 32 */
#define CAN_INTID_STATUS               (0x8000)            /*!< Status Interrupt                 */

/** @} */

/** @defgroup CAN_TEST_Bit_Definitions TEST: CAN Test Register
  * @{
  */

#define CAN_TEST_Mask                  (0x000c)            /*!< Usable bits in TEST register     */

#define CAN_TX_Mask                    (0x0003 << 5)       /*!< TX Line control bitmask          */
#define CAN_TX_Shift                   (5)                 /*!< Bit shift of TX mask             */
#define CAN_TX_NORMAL                  (0x00 << 5)         /*!< TXD line controlled by CAN ctlr  */
#define CAN_TX_MONITOR                 (0x01 << 5)         /*!< TXD line can be monitored        */
#define CAN_TX_LOW                     (0x02 << 5)         /*!< Force TXD low (dominant)         */
#define CAN_TX_HIGH                    (0x03 << 5)         /*!< Force TXD high (recessive)       */

#define CAN_BASIC                      (1 << 2)            /*!< Enable basic mode (IF1/TX,IF2/RX)*/
#define CAN_SILENT                     (1 << 3)            /*!< Force silent operation           */
#define CAN_LBACK                      (1 << 4)            /*!< Enable Loopback mode             */
#define CAN_RX                         (1 << 7)            /*!< Monitor value of RX pin (RO)     */

/** @} */

/** @defgroup CAN_BRPE_Bit_Definitions BRPE: CAN Baud Rate Prescaler Extension Register
  * @{
  */

#define CAN_BRPE_Mask                  (0x0007)            /*!< Baudrate Prescaler Extension bits*/

/** @} */

