coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
/** @defgroup CAN_IF_CMDREQ_Bit_Definitions IFxCMDREQ: Message Interface Cmd. Request Reg.
  * @{
  */

#define CAN_IF_CMDREQ_Mask             (0x103f)            /*!< Usable bits in IFxCMDREQ regs    */

#define CAN_IF_MN_Mask                 (0x003f)            /*!< Message Number Bitmask           */
#define CAN_IF_MN_Shift                (0)                 /*!< Bit shift of IFxMN mask          */

#define CAN_BUSY                       (1 << 15)           /*!< CMDREQ Register Busy Flag (RO)   */

/** @} */

/** @defgroup CAN_IF_CMDMSK_Bit_Definitions IFxCMDMSK: Message Interface Command Mask Reg.
  * @{
  */

#define CAN_IF_CMDMSK_Mask             (0x00ff)            /*!< Usable bits in IFxCMDMSK regs    */

#define CAN_IF_DATA_B                  (1 << 0)            /*!< xfer Data Bytes 4-7 to/frm msg   */
#define CAN_IF_DATA_A                  (1 << 1)            /*!< xfer Data Bytes 0-3 to/frm msg   */
#define CAN_IF_TXRQST                  (1 << 2)            /*!< Request Transmission   (WR mode) */
#define CAN_IF_TXRQST                  (1 << 2)            /*!< Clear NEWDAT bit       (RD mode) */
#define CAN_IF_CLRINTPND               (1 << 3)            /*!< Clear Interrupt Pending (RD mode)*/
#define CAN_IF_CTRL                    (1 << 4)            /*!< xfer Ctrl Bits to/from message   */
#define CAN_IF_ARB                     (1 << 5)            /*!< xfer Arbitration bits to/frm msg */
#define CAN_IF_MASK                    (1 << 6)            /*!< xfer ID MASK bits to/from msg    */
#define CAN_IF_WR                      (1 << 7)            /*!< Write Mode                       */

/** @} */

/** @defgroup CAN_IF_MASK1_Bit_Definitions IFxMASK1: Message Interface ID Mask Reg. 1
  * @{
  */

#define CAN_IF_MASK1_Mask              (0xffff)            /*!< Usable bits in IFnMASK1 regs     */

#define CAN_IF_IDMASK1_Mask            (0xffff)            /*!< Bits for ID Mask bits[0:15]      */
#define CAN_IF_IDMASK1_Shift           (0)                 /*!< Bit shift of IFxIDMASK1 mask     */

/** @} */

/** @defgroup CAN_IF_MASK2_Bit_Definitions IFxMASK2: Message Interface ID Mask Register 2
  * @{
  */

#define CAN_IF_MASK2_Mask              (0xdfff)            /*!< Usable bits in IFxMASK2 regs     */

#define CAN_IF_IDMASK2_Mask            (0x0fff)            /*!< Bits for ID Mask bits[28:16]     */
#define CAN_IF_IDMASK2_Shift           (0)                 /*!< Bit shift of IFxIDMASK2 mask     */

#define CAN_IF_MDIR                    (1 << 14)           /*!< DIR bit used for accept filtering*/
#define CAN_IF_MXTD                    (1 << 15)           /*!< XTD bit used for accept filtering*/

/** @} */

/** @defgroup CAN_IF_ARB1_Bit_Definitions IFxARB1: Message Interface Arbitration 1 Reg.
  * @{
  */

#define CAN_IF_ARB1_Mask               (0xffff)            /*!< Usable bits in IFxARB1 registers */

#define CAN_IF_ID1_Mask                (0xffff)            /*!< CAN ID Bits 0-15                 */
#define CAN_IF_ID1_Shift               (0)                 /*!< Bit shift of IFxID1 mask         */

/** @} */

/** @defgroup CAN_IF_ARB2_Bit_Definitions IFxARB2: Message Interface Arbitration 2 Registers
  * @{
  */

#define CAN_IF_ARB2_Mask               (0xffff)            /*!< Usable bits in IFxARB2 registers */

#define CAN_IF_ID2_Mask                (0x0fff)            /*!< CAN ID Bits[16:28]               */
#define CAN_IF_ID2_Shift               (0)                 /*!< Bit shift of IFxID2 mask         */

#define CAN_IF_DIR                     (1 << 13)           /*!< Message Direction is TX          */
#define CAN_IF_XTD                     (1 << 14)           /*!< Extended Identifier (29b vs 11b) */
#define CAN_IF_MSGVAL                  (1 << 15)           /*!< Message Valid (reset by CPU)     */

/** @} */

/** @defgroup CAN_IF_MCTRL_Bit_Definitions IFxMCTRL: Message Interface Message Control Reg
  * @{
  */

#define CAN_IF_MCTRL_Mask              (0xff8f)            /*!< Usable bits in IFxMCTRL regs     */

#define CAN_IF_DLC_Mask                (0x000f)            /*!< Data Length Code of message      */
#define CAN_IF_DLC_Shift               (0)                 /*!< Bit shift of IFxDLC mask         */

#define CAN_IF_EOB                     (1 << 7)            /*!< End of Buffer (single/last obj.) */
#define CAN_IF_TXRQST                  (1 << 8)            /*!< Object waiting to be Tx'd        */
#define CAN_IF_RMTEN                   (1 << 9)            /*!< Remote Enable (TXRQST set on rx) */
#define CAN_IF_RXIE                    (1 << 10)           /*!< Rx Interrupt Enable              */
#define CAN_IF_TXIE                    (1 << 11)           /*!< Tx Interrupt Enable              */
#define CAN_IF_UMASK                   (1 << 12)           /*!< Ena MSK[28:0], MXTD, MDIR filters*/
#define CAN_IF_INTPND                  (1 << 13)           /*!< Interrupt is Pending on msg obj  */
#define CAN_IF_MSGLST                  (1 << 14)           /*!< Message Lost (overwrote a msg)   */
#define CAN_IF_NEWDAT                  (1 << 15)           /*!< New Data Written to msg object   */

/** @} */

/** @defgroup CAN_IF_DA1_Bit_Definitions IFxDA1: Message Interface Data A1 Registers
  * @{
  */

#define CAN_IF_DA1_Mask                (0xffff)            /*!< Usable bits in IFxDA1 registers  */

#define CAN_IF_DATA0_Mask              (0xff)              /*!< Data Byte 0 Bitmask              */
#define CAN_IF_DATA0_Shift             (0)                 /*!< Bit shift of IFxDATA0 mask       */

#define CAN_IF_DATA1_Mask              (0xff << 8)         /*!< Data Byte 1 Bitmask              */
#define CAN_IF_DATA1_Shift             (8)                 /*!< Bit shift of IFxDATA1 mask       */

/** @} */

/** @defgroup CAN_IF_DA2_Bit_Definitions IFxDA2: Message Interface Data A2 Registers
  * @{
  */

#define CAN_IF_DB2_Mask                (0xffff)            /*!< Usable bits in IFxDA2 registers  */

#define CAN_IF_DATA2_Mask              (0xff)              /*!< Data Byte 2 Bitmask              */
#define CAN_IF_DATA2_Shift             (0)                 /*!< Bit shift of IFxDATA2 mask       */

#define CAN_IF_DATA3_Mask              (0xff << 8)         /*!< Data Byte 3 Bitmask              */
#define CAN_IF_DATA3_Shift             (8)                 /*!< Bit shift of IFxDATA3 mask       */

/** @} */

