coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
/** @defgroup CAN_IF_DB1_Bit_Definitions IFxDB1: Message Interface Data B1 Registers
  * @{
  */

#define CAN_IF_DB1_Mask                (0xffff)            /*!< Usable bits in IFxDB1 registers  */

#define CAN_IF_DATA4_Mask              (0xff)              /*!< Data Byte 4 Bitmask              */
#define CAN_IF_DATA4_Shift             (0)                 /*!< Bit shift of IFxDATA4 mask       */

#define CAN_IF_DATA5_Mask              (0xff << 8)         /*!< Data Byte 5 Bitmask              */
#define CAN_IF_DATA5_Shift             (8)                 /*!< Bit shift of IFxDATA5 mask       */


/** @} */

/** @defgroup CAN_IF_DB2_Bit_Definitions IFxDB2: Message Interface Data B2 Registers
  * @{
  */

#define CAN_DB2_Mask                   (0xffff)            /*!< Usable bits in IFxDB2 registers  */

#define CAN_DATA6_Mask                 (0xff)              /*!< Data Byte 6 Bitmask              */
#define CAN_DATA6_Shift                (0)                 /*!< Bit shift of IFxDATA6 mask       */

#define CAN_DATA7_Mask                 (0xff << 8)         /*!< Data Byte 7 Bitmask              */
#define CAN_DATA7_Shift                (8)                 /*!< Bit shift of IFxDATA7 mask       */

/** @} */

/** @defgroup CAN_TXREQ1_Bit_Definitions TXREQ1: Transmit Request Register 1 (RO)
  * @{
  */

#define CAN_TXREQ1_Mask                (0xffff)            /*!< Usable bits in TXREQ1 register   */

#define CAN_TXRQST_1                   (1 << 0)            /*!< Message Object 1 Tx Pending      */
#define CAN_TXRQST_2                   (1 << 1)            /*!< Message Object 2 Tx Pending      */
#define CAN_TXRQST_3                   (1 << 2)            /*!< Message Object 3 Tx Pending      */
#define CAN_TXRQST_4                   (1 << 3)            /*!< Message Object 4 Tx Pending      */
#define CAN_TXRQST_5                   (1 << 4)            /*!< Message Object 5 Tx Pending      */
#define CAN_TXRQST_6                   (1 << 5)            /*!< Message Object 6 Tx Pending      */
#define CAN_TXRQST_7                   (1 << 6)            /*!< Message Object 7 Tx Pending      */
#define CAN_TXRQST_8                   (1 << 7)            /*!< Message Object 8 Tx Pending      */
#define CAN_TXRQST_9                   (1 << 8)            /*!< Message Object 9 Tx Pending      */
#define CAN_TXRQST_10                  (1 << 9)            /*!< Message Object 10 Tx Pending     */
#define CAN_TXRQST_11                  (1 << 10)           /*!< Message Object 11 Tx Pending     */
#define CAN_TXRQST_12                  (1 << 11)           /*!< Message Object 12 Tx Pending     */
#define CAN_TXRQST_13                  (1 << 12)           /*!< Message Object 13 Tx Pending     */
#define CAN_TXRQST_14                  (1 << 13)           /*!< Message Object 14 Tx Pending     */
#define CAN_TXRQST_15                  (1 << 14)           /*!< Message Object 15 Tx Pending     */
#define CAN_TXRQST_16                  (1 << 15)           /*!< Message Object 16 Tx Pending     */

/** @} */

/** @defgroup CAN_TXREQ2_Bit_Definitions TXREQ2: Transmit Request Register 2 (RO)
  * @{
  */

#define CAN_TXREQ2_Mask                (0xffff)            /*!< Usable bits in TXREQ2 register   */

#define CAN_TXRQST_17                  (1 << 0)            /*!< Message Object 17 Tx Pending     */
#define CAN_TXRQST_18                  (1 << 1)            /*!< Message Object 18 Tx Pending     */
#define CAN_TXRQST_19                  (1 << 2)            /*!< Message Object 19 Tx Pending     */
#define CAN_TXRQST_20                  (1 << 3)            /*!< Message Object 20 Tx Pending     */
#define CAN_TXRQST_21                  (1 << 4)            /*!< Message Object 21 Tx Pending     */
#define CAN_TXRQST_22                  (1 << 5)            /*!< Message Object 22 Tx Pending     */
#define CAN_TXRQST_23                  (1 << 6)            /*!< Message Object 23 Tx Pending     */
#define CAN_TXRQST_24                  (1 << 7)            /*!< Message Object 24 Tx Pending     */
#define CAN_TXRQST_25                  (1 << 8)            /*!< Message Object 25 Tx Pending     */
#define CAN_TXRQST_26                  (1 << 9)            /*!< Message Object 26 Tx Pending     */
#define CAN_TXRQST_27                  (1 << 10)           /*!< Message Object 27 Tx Pending     */
#define CAN_TXRQST_28                  (1 << 11)           /*!< Message Object 28 Tx Pending     */
#define CAN_TXRQST_29                  (1 << 12)           /*!< Message Object 29 Tx Pending     */
#define CAN_TXRQST_30                  (1 << 13)           /*!< Message Object 30 Tx Pending     */
#define CAN_TXRQST_31                  (1 << 14)           /*!< Message Object 31 Tx Pending     */
#define CAN_TXRQST_32                  (1 << 15)           /*!< Message Object 32 Tx Pending     */

/** @} */

/** @defgroup CAN_ND1_Bit_Definitions ND1: New Data Register 1 (RO)
  * @{
  */

#define CAN_ND1_Mask                   (0xffff)            /*!< Usable bits in ND1 register      */

#define CAN_NEWDAT_1                   (1 << 0)            /*!< Message Object 1 Has New Data    */
#define CAN_NEWDAT_2                   (1 << 1)            /*!< Message Object 2 Has New Data    */
#define CAN_NEWDAT_3                   (1 << 2)            /*!< Message Object 3 Has New Data    */
#define CAN_NEWDAT_4                   (1 << 3)            /*!< Message Object 4 Has New Data    */
#define CAN_NEWDAT_5                   (1 << 4)            /*!< Message Object 5 Has New Data    */
#define CAN_NEWDAT_6                   (1 << 5)            /*!< Message Object 6 Has New Data    */
#define CAN_NEWDAT_7                   (1 << 6)            /*!< Message Object 7 Has New Data    */
#define CAN_NEWDAT_8                   (1 << 7)            /*!< Message Object 8 Has New Data    */
#define CAN_NEWDAT_9                   (1 << 8)            /*!< Message Object 9 Has New Data    */
#define CAN_NEWDAT_10                  (1 << 9)            /*!< Message Object 10 Has New Data   */
#define CAN_NEWDAT_11                  (1 << 10)           /*!< Message Object 11 Has New Data   */
#define CAN_NEWDAT_12                  (1 << 11)           /*!< Message Object 12 Has New Data   */
#define CAN_NEWDAT_13                  (1 << 12)           /*!< Message Object 13 Has New Data   */
#define CAN_NEWDAT_14                  (1 << 13)           /*!< Message Object 14 Has New Data   */
#define CAN_NEWDAT_15                  (1 << 14)           /*!< Message Object 15 Has New Data   */
#define CAN_NEWDAT_16                  (1 << 15)           /*!< Message Object 16 Has New Data   */

/** @} */

/** @defgroup CAN_ND2_Bit_Definitions ND2: New Data Register 2 (RO)
  * @{
  */

#define CAN_ND2_Mask                   (0xffff)            /*!< Useable Bits in ND2 register     */

