coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
#define CAN_NEWDAT_17                  (1 << 0)            /*!< Message Object 17 Has New Data   */
#define CAN_NEWDAT_18                  (1 << 1)            /*!< Message Object 18 Has New Data   */
#define CAN_NEWDAT_19                  (1 << 2)            /*!< Message Object 19 Has New Data   */
#define CAN_NEWDAT_20                  (1 << 3)            /*!< Message Object 20 Has New Data   */
#define CAN_NEWDAT_21                  (1 << 4)            /*!< Message Object 21 Has New Data   */
#define CAN_NEWDAT_22                  (1 << 5)            /*!< Message Object 22 Has New Data   */
#define CAN_NEWDAT_23                  (1 << 6)            /*!< Message Object 23 Has New Data   */
#define CAN_NEWDAT_24                  (1 << 7)            /*!< Message Object 24 Has New Data   */
#define CAN_NEWDAT_25                  (1 << 8)            /*!< Message Object 25 Has New Data   */
#define CAN_NEWDAT_26                  (1 << 9)            /*!< Message Object 26 Has New Data   */
#define CAN_NEWDAT_27                  (1 << 10)           /*!< Message Object 27 Has New Data   */
#define CAN_NEWDAT_28                  (1 << 11)           /*!< Message Object 28 Has New Data   */
#define CAN_NEWDAT_29                  (1 << 12)           /*!< Message Object 29 Has New Data   */
#define CAN_NEWDAT_30                  (1 << 13)           /*!< Message Object 30 Has New Data   */
#define CAN_NEWDAT_31                  (1 << 14)           /*!< Message Object 31 Has New Data   */
#define CAN_NEWDAT_32                  (1 << 15)           /*!< Message Object 32 Has New Data   */

/** @} */

/** @defgroup CAN_IR1_Bit_Definitions IR1: Interrupt Pending Register 1 (RO)
  * @{
  */

#define CAN_IR1_Mask                   (0xffff)            /*!< Usable Bits in IR1 register      */

#define CAN_INTPND_1                   (1 << 0)            /*!< Message Object 1 Int. Pending    */
#define CAN_INTPND_2                   (1 << 1)            /*!< Message Object 2 Int. Pending    */
#define CAN_INTPND_3                   (1 << 2)            /*!< Message Object 3 Int. Pending    */
#define CAN_INTPND_4                   (1 << 3)            /*!< Message Object 4 Int. Pending    */
#define CAN_INTPND_5                   (1 << 4)            /*!< Message Object 5 Int. Pending    */
#define CAN_INTPND_6                   (1 << 5)            /*!< Message Object 6 Int. Pending    */
#define CAN_INTPND_7                   (1 << 6)            /*!< Message Object 7 Int. Pending    */
#define CAN_INTPND_8                   (1 << 7)            /*!< Message Object 8 Int. Pending    */
#define CAN_INTPND_9                   (1 << 8)            /*!< Message Object 9 Int. Pending    */
#define CAN_INTPND_10                  (1 << 9)            /*!< Message Object 10 Int. Pending   */
#define CAN_INTPND_11                  (1 << 10)           /*!< Message Object 11 Int. Pending   */
#define CAN_INTPND_12                  (1 << 11)           /*!< Message Object 12 Int. Pending   */
#define CAN_INTPND_13                  (1 << 12)           /*!< Message Object 13 Int. Pending   */
#define CAN_INTPND_14                  (1 << 13)           /*!< Message Object 14 Int. Pending   */
#define CAN_INTPND_15                  (1 << 14)           /*!< Message Object 15 Int. Pending   */
#define CAN_INTPND_16                  (1 << 15)           /*!< Message Object 16 Int. Pending   */

/** @} */

/** @defgroup CAN_IR2_Bit_Definitions IR2: Interrupt Pending Register 2 (RO)
  * @{
  */

#define CAN_IR2_Mask                   (0xffff)            /*!< Usable bits in IR2 register      */

#define CAN_INTPND_17                  (1 << 0)            /*!< Message Object 17 Int. Pending   */
#define CAN_INTPND_18                  (1 << 1)            /*!< Message Object 18 Int. Pending   */
#define CAN_INTPND_19                  (1 << 2)            /*!< Message Object 19 Int. Pending   */
#define CAN_INTPND_20                  (1 << 3)            /*!< Message Object 20 Int. Pending   */
#define CAN_INTPND_21                  (1 << 4)            /*!< Message Object 21 Int. Pending   */
#define CAN_INTPND_22                  (1 << 5)            /*!< Message Object 22 Int. Pending   */
#define CAN_INTPND_23                  (1 << 6)            /*!< Message Object 23 Int. Pending   */
#define CAN_INTPND_24                  (1 << 7)            /*!< Message Object 24 Int. Pending   */
#define CAN_INTPND_25                  (1 << 8)            /*!< Message Object 25 Int. Pending   */
#define CAN_INTPND_26                  (1 << 9)            /*!< Message Object 26 Int. Pending   */
#define CAN_INTPND_27                  (1 << 10)           /*!< Message Object 27 Int. Pending   */
#define CAN_INTPND_28                  (1 << 11)           /*!< Message Object 28 Int. Pending   */
#define CAN_INTPND_29                  (1 << 12)           /*!< Message Object 29 Int. Pending   */
#define CAN_INTPND_30                  (1 << 13)           /*!< Message Object 30 Int. Pending   */
#define CAN_INTPND_31                  (1 << 14)           /*!< Message Object 31 Int. Pending   */
#define CAN_INTPND_32                  (1 << 15)           /*!< Message Object 32 Int. Pending   */

/** @} */

/** @defgroup CAN_MSGV1_Bit_Definitions MSGV2: Message Valid Register 2 (RO)
  * @{
  */

#define CAN_MSGV1_Mask                 (0xffff)            /*!< Usable bits in MSGV1 register    */

#define CAN_MSGVAL_1                   (1 << 0)            /*!< Message Object 1 Valid           */
#define CAN_MSGVAL_2                   (1 << 1)            /*!< Message Object 2 Valid           */
#define CAN_MSGVAL_3                   (1 << 2)            /*!< Message Object 3 Valid           */
#define CAN_MSGVAL_4                   (1 << 3)            /*!< Message Object 4 Valid           */
#define CAN_MSGVAL_5                   (1 << 4)            /*!< Message Object 5 Valid           */
#define CAN_MSGVAL_6                   (1 << 5)            /*!< Message Object 6 Valid           */
#define CAN_MSGVAL_7                   (1 << 6)            /*!< Message Object 7 Valid           */
#define CAN_MSGVAL_8                   (1 << 7)            /*!< Message Object 8 Valid           */
#define CAN_MSGVAL_9                   (1 << 8)            /*!< Message Object 9 Valid           */
#define CAN_MSGVAL_10                  (1 << 9)            /*!< Message Object 10 Valid          */
#define CAN_MSGVAL_11                  (1 << 10)           /*!< Message Object 11 Valid          */
#define CAN_MSGVAL_12                  (1 << 11)           /*!< Message Object 12 Valid          */
#define CAN_MSGVAL_13                  (1 << 12)           /*!< Message Object 13 Valid          */
#define CAN_MSGVAL_14                  (1 << 13)           /*!< Message Object 14 Valid          */
#define CAN_MSGVAL_15                  (1 << 14)           /*!< Message Object 15 Valid          */
#define CAN_MSGVAL_16                  (1 << 15)           /*!< Message Object 16 Valid          */

/** @} */

/** @defgroup CAN_MSGV2_Bit_Definitions MSGV2: Message Valid Register 2 (RO)
  * @{
  */

#define CAN_MSGV2_Mask                 (0xffff)            /*!< Usable bits in MSGV2 register    */

#define CAN_MSGVAL_17                  (1 << 0)            /*!< Message Object 17 Valid          */
#define CAN_MSGVAL_18                  (1 << 1)            /*!< Message Object 18 Valid          */
#define CAN_MSGVAL_19                  (1 << 2)            /*!< Message Object 19 Valid          */
#define CAN_MSGVAL_20                  (1 << 3)            /*!< Message Object 20 Valid          */
#define CAN_MSGVAL_21                  (1 << 4)            /*!< Message Object 21 Valid          */
#define CAN_MSGVAL_22                  (1 << 5)            /*!< Message Object 22 Valid          */
#define CAN_MSGVAL_23                  (1 << 6)            /*!< Message Object 23 Valid          */
#define CAN_MSGVAL_24                  (1 << 7)            /*!< Message Object 24 Valid          */
#define CAN_MSGVAL_25                  (1 << 8)            /*!< Message Object 25 Valid          */
#define CAN_MSGVAL_26                  (1 << 9)            /*!< Message Object 26 Valid          */
#define CAN_MSGVAL_27                  (1 << 10)           /*!< Message Object 27 Valid          */
#define CAN_MSGVAL_28                  (1 << 11)           /*!< Message Object 28 Valid          */
#define CAN_MSGVAL_29                  (1 << 12)           /*!< Message Object 29 Valid          */
#define CAN_MSGVAL_30                  (1 << 13)           /*!< Message Object 30 Valid          */
#define CAN_MSGVAL_31                  (1 << 14)           /*!< Message Object 31 Valid          */
#define CAN_MSGVAL_32                  (1 << 15)           /*!< Message Object 32 Valid          */

/** @} */

/** @defgroup CAN_CLKDIV_Bit_Definitions CLKDIV: Clock Divider Register
  *
  * Note: Divisor is (Register Value) + 1; e.g. writing 1 means PCLK / 2
  * @{
  */

#define CAN_CLKDIV_Mask                (0x0007)            /*!< Usable bits in CLKDIV register   */

/** @} */

/**
  * @}
  */

#endif /* #if defined(LPC11CXX) */


/* Device ID Values -----------------------------------------------------------------------------*/

