coderkan/CMSISv2p00_LPC11xx/inc/iodef.h
/** @defgroup LPC11xx_DeviceIDs LPC11xx Device ID Values
  * @{
  */

#define DeviceID_LPC1111_101           (0x041e502bUL)         /*!< LPC1111  w/8K  FLASH / 2K RAM */
#define DeviceID_LPC1111_102           (0x2516d02bUL)         /*!< LPC1111L w/8K  FLASH / 2K RAM */
#define DeviceID_LPC1111_201           (0x0416502bUL)         /*!< LPC1111  w/8K  FLASH / 4K RAM */
#define DeviceID_LPC1111_202           (0x2516902bUL)         /*!< LPC1111L w/8K  FLASH / 4K RAM */
#define DeviceID_LPC1112_101           (0x042d502bUL)         /*!< LPC1112  w/16K FLASH / 2K RAM */
#define DeviceID_LPC1112_102           (0x2524d02bUL)         /*!< LPC1112L w/16K FLASH / 2K RAM */
#define DeviceID_LPC1112_201           (0x0425502bUL)         /*!< LPC1112  w/16K FLASH / 4K RAM */
#define DeviceID_LPC1112_202           (0x2524902bUL)         /*!< LPC1112L w/16K FLASH / 2K RAM */
#define DeviceID_LPC1113_201           (0x0434502bUL)         /*!< LPC1113  w/24K FLASH / 4K RAM */
#define DeviceID_LPC1113_202           (0x2532902bUL)         /*!< LPC1113L w/24K FLASH / 4K RAM */
#define DeviceID_LPC1113_301           (0x0434102bUL)         /*!< LPC1113  w/24K FLASH / 8K RAM */
#define DeviceID_LPC1113_302           (0x2532102bUL)         /*!< LPC1113L w/24K FLASH / 4K RAM */
#define DeviceID_LPC1114_201           (0x0444502bUL)         /*!< LPC1114  w/32K FLASH / 4K RAM */
#define DeviceID_LPC1114_202           (0x2540902bUL)         /*!< LPC1114L w/32K FLASH / 4K RAM */
#define DeviceID_LPC1114_301           (0x0444102bUL)         /*!< LPC1114  w/32K FLASH / 8K RAM */
#define DeviceID_LPC1114_302           (0x2540102bUL)         /*!< LPC1114L w/32K FLASH / 8K RAM */
#define DeviceID_LPC11C12_301          (0x1421102bUL)         /*!< LPC11C12 w/16K FLASH / 8K RAM */
#define DeviceID_LPC11C14_301          (0x1440102bUL)         /*!< LPC11C14 w/32K FLASH / 8K RAM */
#define DeviceID_LPC11C22_301          (0x1431102bUL)         /*!< LPC11C22 w/16K FLASH / 8K RAM */
#define DeviceID_LPC11C24_301          (0x1430102bUL)         /*!< LPC11C24 w/32K FLASH / 8K RAM */

/** @} */


/* Peripheral Memory Locations ------------------------------------------------------------------*/

/**
  * @defgroup LPC11xx_Peripheral_Addresses LPC11xx Peripheral base memory addresses
  * @{
  */

#define I2C0_BASE       (0x40000000UL)                     /*!< I2C Controller 0                 */
#define WDT_BASE        (0x40004000UL)                     /*!< Watchdog Timer                   */
#define UART0_BASE      (0x40008000UL)                     /*!< UART Peripheral 0                */
#define ADC0_BASE       (0x4001c000UL)                     /*!< Analog to Digital Converter 0    */
#define PMU_BASE        (0x40038000UL)                     /*!< Power Management Unit            */
#define FLASH_BASE      (0x4003c000UL)                     /*!< Flash Configuration Block        */
#define SSP0_BASE       (0x40040000UL)                     /*!< Synch Serial Peripheral 0        */
#define IOCON_BASE      (0x40044000UL)                     /*!< IO Configuration Block           */
#define SYSCON_BASE     (0x40048000UL)                     /*!< System Configuration Block       */
#define SSP1_BASE       (0x40058000UL)                     /*!< Synch Serial Peripheral 1        */
#define CT16B0_BASE     (0x4000c000UL)                     /*!< 16-bit Counter / Timer 0         */
#define CT16B1_BASE     (0x40010000UL)                     /*!< 16-bit Counter / Timer 1         */
#define CT32B0_BASE     (0x40014000UL)                     /*!< 32-bit Counter / Timer 0         */
#define CT32B1_BASE     (0x40018000UL)                     /*!< 32-bit Counter / Timer 1         */
#define GPIO0_BASE      (0x50000000UL)                     /*!< General Purpose IO Port 0        */
#define GPIO1_BASE      (0x50010000UL)                     /*!< General Purpose IO Port 1        */
#define GPIO2_BASE      (0x50020000UL)                     /*!< General Purpose IO Port 2        */
#define GPIO3_BASE      (0x50030000UL)                     /*!< General Purpose IO Port 3        */

#if defined(LPC11CXX)  /* CAN enabled parts */
# define CAN0_BASE      (0x40050000UL)                     /*!< Controller Area Network          */
#endif /* #if defined(LPC11CXX) */

/* Defined in core_cm0.h
#define SYSTICK_BASE    (0xe000e010UL)
#define NVIC_BASE       (0xe000e100UL)
#define SCB_BASE        (0xe000ed00UL)
*/

/**
  * @}
  */


/* Exported Variables ---------------------------------------------------------------------------*/

/**
  * @defgroup LPC11xx_Peripheral_Instances LPC11xx Peripheral Instances
  * @{
  */

#define I2C0            ((I2C_Type *)I2C0_BASE)            /*!< I2C Controller 0                 */
#define WDT             ((WDT_Type *)WDT_BASE)             /*!< Watchdog Timer                   */
#define UART0           ((UART_Type *)UART0_BASE)          /*!< UART Peripheral 0                */
#define ADC0            ((ADC_Type *)ADC0_BASE)            /*!< Analog to Digital Converter 0    */
#define PMU             ((PMU_Type *)PMU_BASE)             /*!< Power Management Unit            */
#define FLASH           ((FLASH_Type *)FLASH_BASE)         /*!< Flash Configuration Block        */
#define SSP0            ((SSP_Type *)SSP0_BASE)            /*!< Synch Serial Peripheral 0        */
#define IOCON           ((IOCON_Type *)IOCON_BASE)         /*!< IO Configuration Block           */
#define SYSCON          ((SYSCON_Type *)SYSCON_BASE)       /*!< System Configuration Block       */
#define SSP1            ((SSP_Type *)SSP1_BASE)            /*!< Synch Serial Peripheral 1        */
#define CT16B0          ((CT16B_Type *)CT16B0_BASE)        /*!< 16-bit Counter / Timer 0         */
#define CT16B1          ((CT16B_Type *)CT16B1_BASE)        /*!< 16-bit Counter / Timer 1         */
#define CT32B0          ((CT32B_Type *)CT32B0_BASE)        /*!< 32-bit Counter / Timer 0         */
#define CT32B1          ((CT32B_Type *)CT32B1_BASE)        /*!< 32-bit Counter / Timer 1         */
#define GPIO0           ((GPIO_Type *)GPIO0_BASE)          /*!< General Purpose IO Port 0        */
#define GPIO1           ((GPIO_Type *)GPIO1_BASE)          /*!< General Purpose IO Port 1        */
#define GPIO2           ((GPIO_Type *)GPIO2_BASE)          /*!< General Purpose IO Port 2        */
#define GPIO3           ((GPIO_Type *)GPIO3_BASE)          /*!< General Purpose IO Port 3        */

#if defined(LPC11CXX)
# define CAN0           ((CAN_Type *)CAN0_BASE)            /*!< Controller Area Network          */
#endif /* #if defined(LPC11CXX) */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


#define UART_Interrupt_Mask            (0x0307)            /*!< Mask of valid int config bits    */

#define UART_Interrupt_RxData          (0x0001)            /*!< Rx'd Data Interrupt Enable       */
#define UART_Interrupt_TxData          (0x0002)            /*!< Tx'd Data Interrupt Enable       */
#define UART_Interrupt_RxLineStatus    (0x0004)            /*!< Receiver Line Status Int Enable  */
#define UART_Interrupt_AutobaudEnd     (0x0100)            /*!< End of Auto Baud Int Enable      */
#define UART_Interrupt_AutobaudTimeout (0x0200)            /*!< Auto Baud Timeout Int Enable     */
/*
// Added by Erkan
#define IER_RBR		0x01
#define IER_THRE	0x02
#define IER_RLS		0x04

#define IIR_PEND	0x01
#define IIR_RLS		0x03
#define IIR_RDA		0x02
#define IIR_CTI		0x06
#define IIR_THRE	0x01

#define LSR_RDR		0x01
#define LSR_OE		0x02
#define LSR_PE		0x04
#define LSR_FE		0x08
#define LSR_BI		0x10
#define LSR_THRE	0x20
#define LSR_TEMT	0x40
#define LSR_RXFE	0x80

#define BUFSIZE  1024
*/

#ifdef __cplusplus
};
#endif

#endif /* INC_IODEF_H_ */
